JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
/**
 * @file cw32l012_lpi2c.c
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2022-7-12
 *
 * @copyright Copyright (c) 2021
 *
 */

/*******************************************************************************
 *
 * 代码许可和免责信息
 * 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
 * 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
 * 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
 * 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
 * 或条件。
 * 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
 * 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
 * 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
 * 损失。
 * 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
 * 全部上述排除或限制可能并不适用于您。
 *
 *******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "cw32l012_lpi2c.h"
#include "cw32l012_sysctrl.h"

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static status_t LPI2C_MasterWaitForTxReady(I2C_TypeDef *I2Cx);

static status_t LPI2C_RunTransferStateMachine(I2C_TypeDef *I2Cx, lpi2c_master_handle_t *handle, boolean_t *isDone);

static void LPI2C_InitTransferStateMachine(lpi2c_master_handle_t *handle);

static status_t LPI2C_SlaveCheckAndClearError(I2C_TypeDef *I2Cx, uint32_t flags);

static uint8_t I2C_MasterPollingFlagCommon(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG, boolean_t reverse);

static uint8_t I2C_SlavePollingFlagCommon(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG, boolean_t reverse);

static uint32_t I2C_GetCyclesForWidth(uint32_t sourceClock_Hz, uint32_t width_ns, uint32_t minCycles, uint32_t maxCycles, uint32_t prescaler);


/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @brief Array to map LPI2C instance number to base pointer. */
static I2C_TypeDef *const kLpi2cBases[] = LPI2C_BASE_PTRS;

/*! @brief Array to map LPI2C instance number to IRQ number, used internally for LPI2C master interrupt APIs. */
IRQn_Type const kLpi2cIrqs[] = LPI2C_IRQS;

/*! @brief Pointer to master IRQ handler for each instance, used internally for LPI2C master interrupt APIs. */
lpi2c_master_isr_t s_lpi2cMasterIsr;

/*! @brief Pointers to master handles for each instance, used internally for LPI2C master interrupt APIs. */
void *s_lpi2cMasterHandle[ARRAY_SZ(kLpi2cBases)];

/*! @brief Pointer to slave IRQ handler for each instance. */
static lpi2c_slave_isr_t s_lpi2cSlaveIsr;

/*! @brief Pointers to slave handles for each instance. */
static lpi2c_slave_handle_t *s_lpi2cSlaveHandle[ARRAY_SZ(kLpi2cBases)];


/* Private_TypesDefinitions --------------------------------------------------*/

/* Private_Defines -----------------------------------------------------------*/

/* Private_Variables ---------------------------------------------------------*/

/* Private_FunctionPrototypes ------------------------------------------------*/

/* Private_Functions ---------------------------------------------------------*/

/* Public_Functions ----------------------------------------------------------*/

/**
 * @brief 初始化I2C主设备
 *
 * 初始化I2C主设备，包括配置时钟源、调试模式、休眠模式、引脚配置、总线空闲超时、引脚低电平超时等参数。
 *
 * @param I2Cx I2C设备指针
 * @param I2C_MasterConfig I2C主设备配置结构体指针
 * @param sourceClock_Hz 主时钟频率（Hz）
 *
 * @return ErrorStatus 错误状态码
 *         - SUCCESS: 初始化成功
 *         - ERROR: 初始化失败
 */
ErrorStatus I2C_MasterInit(I2C_TypeDef *I2Cx, I2C_MasterConfigTypeDef *I2C_MasterConfig, uint32_t sourceClock_Hz)
{
    ErrorStatus RetVal = SUCCESS;
    uint32_t prescaler;
    uint32_t cycles;
    uint32_t cfgr2;

    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    if ((uint32_t)I2Cx == (uint32_t)CW_I2C1)
    {
        // 打开I2C1模块的时钟
        __SYSCTRL_I2C1_CLK_ENABLE();
    }
    else if((uint32_t)I2Cx == (uint32_t)CW_I2C2)
    {
        // 打开I2C2模块的时钟
        __SYSCTRL_I2C2_CLK_ENABLE();
    }
    else
    {
        return ERROR;
    }

    /* 配置前先对I2C Master复位 */
    I2C_MasterSoftReset(I2Cx);

    /* 配置总线输入信号选择寄存器 */
    REGBITS_MODIFY(I2Cx->INSEL, I2Cx_INSEL_SDAINSEL_Msk | I2Cx_INSEL_SCLINSEL_Msk,
                   ((uint32_t)(I2C_MasterConfig->I2C_SDA_Source)) | ((uint32_t)(I2C_MasterConfig->I2C_SCL_Source)));

    /* 配置时钟源及调试、休眠模式 */
    REGBITS_MODIFY(I2Cx->MCR0, I2Cx_MCR0_CLKSRC_Msk | I2Cx_MCR0_DBGEN_Msk | I2Cx_MCR0_SLEEPEN_Msk,
                   ((uint32_t)(I2C_MasterConfig->I2C_ClockSouce)) |
                       (((uint32_t)(I2C_MasterConfig->I2C_InDebugState & 0x01)) << I2Cx_MCR0_DBGEN_Pos) |
                       (((uint32_t)(I2C_MasterConfig->I2C_InDeepSleepState & 0x01)) << I2Cx_MCR0_SLEEPEN_Pos));

    /* pin config and ignore ack, MATCFG*/
    REGBITS_MODIFY(I2Cx->MCR2, I2Cx_MCR2_PINCFG_Msk | I2Cx_MCR2_IGNACK_Msk | I2Cx_MCR2_MATCFG_Msk,
                   (((uint32_t)(I2C_MasterConfig->I2C_PinsConfig & 0x07)) << I2Cx_MCR2_PINCFG_Pos) |
                       ((uint32_t)(I2C_MasterConfig->ignoreAck) << I2Cx_MCR2_IGNACK_Pos) |
                       ((I2C_MasterConfig->I2C_DataMatchMode) << I2Cx_MCR2_MATCFG_Pos));

    /* Configure glitch filters. */
    cfgr2 = I2Cx->MCR3;

    if (0U != (I2C_MasterConfig->sdaGlitchFilterWidth_ns))
    {
        /* Calculate SDA filter width. The width is equal to FILTSDA cycles of functional clock.
            And set FILTSDA to 0 disables the fileter, so the min value is 1. */
        cycles = I2C_GetCyclesForWidth(sourceClock_Hz, I2C_MasterConfig->sdaGlitchFilterWidth_ns, 1U,
                                       (I2Cx_MCR3_FLTSDA_Msk >> I2Cx_MCR3_FLTSDA_Pos), 0U);
        cfgr2 &= ~I2Cx_MCR3_FLTSDA_Msk;
        cfgr2 |= I2C_MCR3_FILTSDA(cycles);
    }

    if (0U != I2C_MasterConfig->sclGlitchFilterWidth_ns)
    {
        /* Calculate SDL filter width. The width is equal to FILTSCL cycles of functional clock.
            And set FILTSCL to 0 disables the fileter, so the min value is 1. */
        cycles = I2C_GetCyclesForWidth(sourceClock_Hz, I2C_MasterConfig->sclGlitchFilterWidth_ns, 1U,
                                       (I2Cx_MCR3_FLTSCL_Msk >> I2Cx_MCR3_FLTSCL_Pos), 0U);
        cfgr2 &= ~I2Cx_MCR3_FLTSCL_Msk;
        cfgr2 |= I2C_MCR3_FILTSCL(cycles);
    }

    I2Cx->MCR3 = cfgr2;

