JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
    /* Configure baudrate after the SDA/SCL glitch filter setting,
       since the baudrate calculation needs them as parameter. */
    I2C_MasterSetBaudRate(I2Cx, sourceClock_Hz, I2C_MasterConfig->I2C_BaudRate_Hz);

    /* Configure bus idle and pin low timeouts after baudrate setting,
       since the timeout calculation needs prescaler as parameter. */
    prescaler = (I2Cx->MCR2 & I2Cx_MCR2_PRESCALE_Msk) >> I2Cx_MCR2_PRESCALE_Pos;

    if (0U != (I2C_MasterConfig->busIdleTimeout_ns))
    {
        /* Calculate bus idle timeout value. The value is equal to BUSIDLE cycles of functional clock divided by
            prescaler. And set BUSIDLE to 0 disables the fileter, so the min value is 1. */
        cycles = I2C_GetCyclesForWidth(sourceClock_Hz, I2C_MasterConfig->busIdleTimeout_ns, 1U,
                                       (I2Cx_MCR3_BUSIDLE_Msk >> I2Cx_MCR3_BUSIDLE_Pos), prescaler);
        cfgr2 &= ~I2Cx_MCR3_BUSIDLE_Msk;
        cfgr2 |= I2C_MCR3_BUSIDLE(cycles);
    }

    I2Cx->MCR3 = cfgr2;

    if (0U != I2C_MasterConfig->pinLowTimeout_ns)
    {
        /* Calculate bus pin low timeout value. The value is equal to PINLOW cycles of functional clock divided by
            prescaler. And set PINLOW to 0 disables the fileter, so the min value is 1. */
        cycles = I2C_GetCyclesForWidth(sourceClock_Hz, I2C_MasterConfig->pinLowTimeout_ns / 256U, 1U,
                                       (I2Cx_MCR3_BUSIDLE_Msk >> I2Cx_MCR3_BUSIDLE_Pos), prescaler);
        I2Cx->MCR4 = (I2Cx->MCR4 & ~I2Cx_MCR4_PINLOW_Msk) | I2C_MCR4_PINLOW(cycles);
    }

    return RetVal;
}

/**
 * @brief 初始化I2C从设备
 *
 * 该函数用于初始化I2C从设备，包括设置从设备地址、时钟延展、滤波时钟源等。
 *
 * @param I2Cx 指向I2C外设的指针
 * @param I2C_SlaveConfig 指向I2C从设备配置结构体的指针
 * @param sourceClock_Hz I2C外设的时钟源频率，单位为Hz
 *
 * @return ErrorStatus 返回初始化状态
 *         - SUCCESS: 初始化成功
 *         - ERROR: 初始化失败
 */
ErrorStatus I2C_SlaveInit(I2C_TypeDef *I2Cx, I2C_SlaveConfigTypeDef *I2C_SlaveConfig, uint32_t sourceClock_Hz)
{
    ErrorStatus RetVal = SUCCESS;
    uint32_t tmpReg;
    uint32_t tmpCycle;

    // 检查I2C外设是否有效
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    // 空指针检查
    if (I2Cx == NULL || I2C_SlaveConfig == NULL)
    {
        return ERROR;
    }

    if ((uint32_t)I2Cx == (uint32_t)CW_I2C1)
    {
        // 打开I2C1模块的时钟
        __SYSCTRL_I2C1_CLK_ENABLE();
    }
    else if ((uint32_t)I2Cx == (uint32_t)CW_I2C2)
    {
        // 打开I2C2模块的时钟
        __SYSCTRL_I2C2_CLK_ENABLE();
    }
    else
    {
        return ERROR;
    }

    /* 配置前先对I2C Slave复位 */
    I2C_SlaveSoftReset(I2Cx);

    /* 配置Slave 从机地址匹配方式 */
    REGBITS_MODIFY(I2Cx->SAMR, I2Cx_SAMR_ADDR1_Msk | I2Cx_SAMR_ADDR0_Msk,
                   ((((uint32_t)(I2C_SlaveConfig->I2C_Addr1 & MAX_SLAVE_ADDR_10B)) << I2Cx_SAMR_ADDR1_Pos) |
                    (((uint32_t)(I2C_SlaveConfig->I2C_Addr0 & MAX_SLAVE_ADDR_10B)) << I2Cx_SAMR_ADDR0_Pos)));

    /* 配置Slave SCR1 */
    I2Cx->SCR1 =
        I2C_SCR1_ADDRCFG(I2C_SlaveConfig->addressMatchMode) | I2C_SCR1_IGNACK(I2C_SlaveConfig->ignoreAck) |
        I2C_SCR1_RXCFG(I2C_SlaveConfig->enableReceivedAddressRead) | I2C_SCR1_GCEN(I2C_SlaveConfig->enableGeneralCall) |
        I2C_SCR1_ACKSTALL(I2C_SlaveConfig->sclStall.enableAck) | I2C_SCR1_TXSTALL(I2C_SlaveConfig->sclStall.enableTx) |
        I2C_SCR1_RXSTALL(I2C_SlaveConfig->sclStall.enableRx) |
        I2C_SCR1_ADRSTALL(I2C_SlaveConfig->sclStall.enableAddress);

    /* Calculate SDA filter width. The width is equal to FILTSDA+3 cycles of functional clock.
        And set FILTSDA to 0 disables the fileter, so the min value is 4. */
    tmpReg = I2C_SCR3_FILTSDA(
        I2C_GetCyclesForWidth(sourceClock_Hz, I2C_SlaveConfig->sdaGlitchFilterWidth_ns, 4U,
                              (I2Cx_SCR3_FLTSDA_Msk >> I2Cx_SCR3_FLTSDA_Pos) + 3U, 0U) - 3U);

    /* Calculate SCL filter width. The width is equal to FILTSCL+3 cycles of functional clock.
        And set FILTSCL to 0 disables the fileter, so the min value is 4. */
    tmpCycle = I2C_GetCyclesForWidth(sourceClock_Hz, I2C_SlaveConfig->sclGlitchFilterWidth_ns, 4U,
                                     (I2Cx_SCR3_FLTSCL_Msk >> I2Cx_SCR3_FLTSCL_Pos) + 3U, 0U);
    tmpReg |= I2C_SCR3_FILTSCL(tmpCycle - 3U);

    /* Calculate data valid time. The time is equal to FILTSCL+DATAVD+3 cycles of functional clock.
        So the min value is FILTSCL+3. */
    tmpReg |= I2C_SCR3_DATAVD(
        I2C_GetCyclesForWidth(sourceClock_Hz, I2C_SlaveConfig->dataValidDelay_ns, tmpCycle,
                              tmpCycle + (I2Cx_SCR3_DATAVD_Msk >> I2Cx_SCR3_DATAVD_Pos), 0U) - tmpCycle);

    /* Calculate clock hold time. The time is equal to CLKHOLD+3 cycles of functional clock.
        So the min value is 3. */
    I2Cx->SCR3 =
        tmpReg | I2C_SCR3_CLKHOLD(
                     I2C_GetCyclesForWidth(sourceClock_Hz, I2C_SlaveConfig->clockHoldTime_ns, 3U,
                                           (I2Cx_SCR3_CLKHOLD_Msk >> I2Cx_SCR3_CLKHOLD_Pos) + 3U, 0U) - 3U);

    REGBITS_MODIFY( I2Cx->SCR0 , I2Cx_SCR0_FLTEN_Msk, (I2C_SlaveConfig->filterEnable << I2Cx_SCR0_FLTEN_Pos));

    return RetVal;
}

/**
 * @brief I2C Master模块使能控制
 *
 * @param I2Cx
 * @param NewState  : ENABLE  DISABLE
 */
void I2C_MasterCmd(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    if (NewState == ENABLE)
    {
        /* Enable the selected I2C peripheral */
        I2Cx->MCR0_f.MEN = 1;
    }
    else
    {
        /* Disable the selected I2C peripheral */
        I2Cx->MCR0_f.MEN = 0;
    }
}

/**
 * @brief I2C Slave模块使能控制
 *
 * @param I2Cx
 * @param NewState  : ENABLE  DISABLE
 */
void I2C_SlaveCmd(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    if (NewState == ENABLE)
    {
        /* Enable the selected I2C peripheral */
        I2Cx->SCR0_f.SEN = 1;
    }
    else
    {
        /* Disable the selected I2C peripheral */
        I2Cx->SCR0_f.SEN = 0;
    }
}

/**
 * @brief I2C 模块去初始化
 *
 * @param I2Cx
 */
void I2C_DeInit(I2C_TypeDef *I2Cx)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    // 复位I2C模块
    if(I2Cx == CW_I2C1)
    {
        CW_SYSCTRL->APBRST2_f.I2C1 = 0;
        CW_SYSCTRL->APBRST2_f.I2C1 = 1;
        // 关闭I2C模块的时钟
        __SYSCTRL_I2C1_CLK_DISABLE();
    }
    else
    {
        CW_SYSCTRL->APBRST2_f.I2C2 = 0;
        CW_SYSCTRL->APBRST2_f.I2C2 = 1;
        // 关闭I2C模块的时钟
        __SYSCTRL_I2C2_CLK_DISABLE();
    }
}

/**
 * @brief 清除I2C主机标志位
 *
 * @param I2Cx I2C外设指针
 * @param I2C_FLAG 要清除的标志位，可以是以下值之一及其组合：
 *                 - I2C_IT_MATCH
 *                 - I2C_IT_PINLOW
 *                 - I2C_IT_FIFO
 *                 - I2C_IT_ARBI
 *                 - I2C_IT_NACK
 *                 - I2C_IT_STOP
 *                 - I2C_IT_PACKET
 *                 - I2C_IT_FRAME
 *
 */
void I2C_MasterClearFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_CLEAR_FLAG(I2C_FLAG));

    REGBITS_CLR(I2Cx->MICR, I2C_FLAG);
}

/**
 * @brief I2C主模式轮询标志位函数
 *
 * 该函数用于在I2C主模式下，通过轮询方式检查指定的I2C标志位状态。
 *
 * @param I2Cx 指向I2C外设的指针
 * @param I2C_FLAG 需要检查的I2C标志位，可以是以下值之一及其组合：
 *                 - I2C_IT_BUSBUSY
 *                 - I2C_IT_MSTBUSY
 *                 - I2C_IT_MATCH
 *                 - I2C_IT_PINLOW
 *                 - I2C_IT_FIFO
 *                 - I2C_IT_ARBI
 *                 - I2C_IT_NACK
 *                 - I2C_IT_STOP
 *                 - I2C_IT_PACKET
 *                 - I2C_IT_FRAME
 *                 - I2C_IT_RXNE
 *                 - I2C_IT_TXE
 * @param reverse 标志位检测逻辑，true表示取反检测，false表示直接检测
 *
 * @return 如果检测到标志位，返回I2C_Status_Success；否则，返回错误代码
 *
 * @note 调用此函数前，需确保传入的I2Cx指针指向有效的I2C外设，I2C_FLAG为有效的I2C标志位。
 *       如果等待超时仍未检测到标志位，返回I2C_Status_Timeout。
 */
static uint8_t I2C_MasterPollingFlagCommon(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG, boolean_t reverse)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_FLAG(I2C_FLAG));

