JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
    for (uint32_t waitTimes = I2C_WAIT_TIMEOUT; waitTimes > 0; --waitTimes)
    {
        uint32_t regVal = I2Cx->MISR;
        uint32_t flagDetected = reverse ? !(regVal & I2C_FLAG) : (regVal & I2C_FLAG);

        if (flagDetected)
        {
            return I2C_Status_Success;
        }
    }

    return I2C_Status_Timeout;
}

/**
 * @brief 查询I2C主机标志位的状态
 *
 * @param I2Cx I2C模块指针
 * @param I2C_FLAG 需要查询的标志位
 *
 * @return 如果标志位被设置，则返回I2C_Status_Success；否则返回错误代码
 */
uint8_t I2C_MasterPollingFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    return I2C_MasterPollingFlagCommon(I2Cx, I2C_FLAG, FALSE);
}

/**
 * @brief 反转查询I2C主模式标志位
 *
 * @param I2Cx I2C接口指针
 * @param I2C_FLAG 要反转的标志位
 *
 * @return 如果标志位未被设置，则返回I2C_Status_Success；否则返回错误代码
 */
uint8_t I2C_MasterPollingFlagReverse(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    return I2C_MasterPollingFlagCommon(I2Cx, I2C_FLAG, TRUE);
}

/**
 * @brief 获取I2C主模式标志位状态
 *
 * @param I2Cx 指向I2C外设的指针
 * @param I2C_FLAG 要检查的I2C标志位
 *
 * @return 标志位状态
 *
 * @note 调用此函数前，请确保I2Cx和I2C_FLAG参数有效。
 */
uint32_t I2C_MasterGetFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_FLAG(I2C_FLAG));

    // 获取并返回指定的标志位状态
    return (I2Cx->MISR & I2C_FLAG);
}

/**
 * @brief 主机发送START信号和从机地址到I2C总线上
 *
 * @param I2Cx: I2C
 * @param slaveAddr:  7-bit从设备地址 .
 * @param dataMode：主机传输的方向，I2C_MODE_WRITE或者I2C_MODE_READ
 * @retval
 */
uint8_t I2C_MasterSTART_Addr7b(I2C_TypeDef *I2Cx, uint8_t slaveAddr, I2C_ModeTypeDef dataMode)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(slaveAddr < 0x80);

    if (I2C_MasterGetFlag(I2Cx, I2C_IT_BUSBUSY | I2C_IT_MSTBUSY))
    {
        return I2C_Status_Busy;
    }

    // 清IT标志
    I2Cx->MICR &= CLEAR_IT_MASK;

    // 发送start+SLA+R/W命令
    I2Cx->MTDR = I2C_Cmd_Tx_RepSTART_Data_Rx_ACK | (slaveAddr << 1) | dataMode;
    return (I2C_MasterPollingFlagReverse(I2Cx, I2C_IT_NACK));
}

/**
 * @brief 主机向I2C从设备发送ReSTART信号和7位地址，并指定数据传输模式
 *
 * @param I2Cx I2C外设指针，指向要使用的I2C外设
 * @param slaveAddr 从设备地址，7位地址，范围为0到127
 * @param dataMode 数据传输模式，指定传输方向（读或写）
 *
 * @return 如果函数成功发送ReSTART信号并设置从设备地址，则返回0；否则返回错误代码
 *
 */
uint8_t I2C_MasterReSTART_Addr7b(I2C_TypeDef *I2Cx, uint8_t slaveAddr, I2C_ModeTypeDef dataMode)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(slaveAddr <= MAX_SLAVE_ADDR_7B);

    // 清IT标志
    I2Cx->MICR &= CLEAR_IT_MASK;

    // 发送start+SLA+R/W命令
    I2Cx->MTDR = I2C_Cmd_Tx_RepSTART_Data_Rx_ACK | (slaveAddr << 1) | dataMode;
    return (I2C_MasterPollingFlagReverse(I2Cx, I2C_IT_NACK));
}

/**
 * @brief 主机向I2C从设备发送10位地址的起始信号和数据模式
 *
 * @param I2Cx I2C模块指针，指向要操作的I2C模块
 * @param slaveAddr 从设备的10位地址
 * @param dataMode 数据模式，指定是读操作还是写操作
 *
 * @return 返回函数执行状态
 *
 */
uint8_t I2C_MasterSTART_Addr10b(I2C_TypeDef *I2Cx, uint16_t slaveAddr, I2C_ModeTypeDef dataMode)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    if (I2C_MasterGetFlag(I2Cx, I2C_IT_BUSBUSY | I2C_IT_MSTBUSY))
    {
        return I2C_Status_Busy;
    }

    // 清IT标志
    I2Cx->MICR &= CLEAR_IT_MASK;

    // 发送start+SLA_MSB+R/W命令
    I2Cx->MTDR = I2C_Cmd_Tx_RepSTART_Data_Rx_ACK | ((uint8_t)((slaveAddr & I2C_SLAVE_ADDR10B_MSB_MASK) >> (8 - 1))) | I2C_SLAVE_ADDR10B_MSB | dataMode;

    if (I2C_MasterPollingFlagReverse(I2Cx, I2C_IT_NACK))
    {
        return I2C_Status_Nak;
    }

    // 发送SLA_LSB命令
    I2Cx->MTDR = (uint8_t)(slaveAddr & I2C_SLAVE_ADDR10B_LSB_MASK);

    return (I2C_MasterPollingFlagReverse(I2Cx, I2C_IT_NACK));
}

/**
 * @brief 主机发送10位地址的I2C主机ReSTART命令
 *
 * @param I2Cx I2C外设的指针
 * @param slaveAddr 从机地址，10位
 * @param dataMode 数据模式，读写标志
 *
 * @return 返回状态码，成功返回I2C_Status_Success，NACK响应返回I2C_Status_Nak，超时返回I2C_Status_Timeout
 */
uint8_t I2C_MasterReSTART_Addr10b(I2C_TypeDef *I2Cx, uint16_t slaveAddr, I2C_ModeTypeDef dataMode)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    // 清IT标志
    I2Cx->MICR &= CLEAR_IT_MASK;

    // 发送start+SLA_MSB+R/W命令
    I2Cx->MTDR = I2C_Cmd_Tx_RepSTART_Data_Rx_ACK | ((uint8_t)((slaveAddr & I2C_SLAVE_ADDR10B_MSB_MASK) >> (8 - 1))) | I2C_SLAVE_ADDR10B_MSB | dataMode;

    if (I2C_MasterPollingFlagReverse(I2Cx, I2C_IT_NACK))
    {
        return I2C_Status_Nak;
    }

    return I2C_Status_Success;
}

/**
 * @brief 主机发送STOP信号到I2C总线
 *
 * @retval
 */
uint8_t I2C_MasterSTOP(I2C_TypeDef *I2Cx)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    if (I2C_MasterPollingFlag(I2Cx, I2C_IT_TXE) != I2C_Status_Success)
    {
        return I2C_Status_Timeout;
    }

    // 发送STOP命令
    I2Cx->MTDR = I2C_Cmd_Tx_STOP;
    // return I2C_Status_Success;
    return (I2C_MasterPollingFlag(I2Cx, I2C_IT_STOP));
}

/**
 * @brief I2C 主机接收数据
 *
 * @param I2Cx
 * @param rxBuff:  接收缓存地址
 * @param rxSize： 接收长度
 * @retval 接收状态，成功返回I2C_Status_Success，失败返回I2C_Status_Error或其他错误码
 */
uint8_t I2C_MasterReceive(I2C_TypeDef *I2Cx, uint8_t *rxBuff, uint16_t rxSize)
{
    uint8_t *buf;

    if ((rxBuff == NULL) || (rxSize == 0))
    {
        return I2C_Status_Error;
    }

    if (I2C_MasterPollingFlag(I2Cx, I2C_IT_TXE) != I2C_Status_Success)
    {
        return I2C_Status_Timeout; // 超时错误
    }

    // 发送接收数据命令
    I2Cx->MTDR = I2C_Cmd_Rx_DataToMRDR | (rxSize - 1);

    // 接收数据
    buf = rxBuff;

    while (rxSize--)
    {
        if (I2C_MasterPollingFlag(I2Cx, I2C_IT_RXNE) != I2C_Status_Success)
        {
            return I2C_Status_Timeout; // 超时错误
        }

        *buf++ = (uint8_t)I2Cx->MRDR;
    }

    return I2C_Status_Success;
}

/**
 * @brief I2C 主机发送数据
 *
 * @param I2Cx
 * @param txBuff:  发送缓存地址
 * @param txSize： 发送长度
 * @retval 发送状态，成功返回I2C_Status_Success，失败返回I2C_Status_Error或其他错误码
 */
uint8_t I2C_MasterSend(I2C_TypeDef *I2Cx, uint8_t *txBuff, uint16_t txSize)
{
    uint8_t *buf;

    // 检查输入参数
    if (txBuff == NULL || txSize == 0)
    {
        return I2C_Status_Error;
    }

    buf = txBuff;

    while (txSize--)
    {
        // 等待TXE标志位被置位，表示发送缓冲区空闲
        if (I2C_MasterPollingFlag(I2Cx, I2C_IT_TXE) != I2C_Status_Success)
        {
            return I2C_Status_Timeout; // 超时错误
        }

        // 发送数据
        I2Cx->MTDR = *buf++;

        if (I2C_MasterPollingFlagReverse(I2Cx, I2C_IT_NACK) != I2C_Status_Success)
        {
            return I2C_Status_Timeout; // 超时错误
        }
    }

    return I2C_Status_Success;
}

/**
 * @brief MCU对I2C总线进行软件复位
 *
 * 该函数用于对指定的I2C总线进行软件复位操作。
 * 将所有主机逻辑和寄存器重置为默认状态，I2C_MCR0 寄存器自身除外
 *
 * @param I2Cx 指向I2C控制器的指针
 */
void I2C_MasterSoftReset(I2C_TypeDef *I2Cx)
{
    I2Cx->MCR0 = I2Cx_MCR0_RESET_Msk;
    I2Cx->MCR0 = 0;
}

/**
 * @brief MCU对I2C从设备进行软件复位
 *
 * 该函数用于对指定的I2C从设备进行软件复位。
 * 将所有从机逻辑和寄存器重置为默认状态，I2C_SCR0寄存器自身除外。
 *
 * @param I2Cx I2C设备的指针，指向需要复位的I2C设备。
 */
void I2C_SlaveSoftReset(I2C_TypeDef *I2Cx)
{
    I2Cx->SCR0 = I2Cx_SCR0_RESET_Msk;
    I2Cx->SCR0 = 0;
}

/**
 * @brief 重置I2C主模式发送FIFO
 *
 * 该函数用于重置I2C主模式的发送FIFO。
 * 写 1 复位发送 FIFO,FIFO 复位后，该 FIFO 为空。

 * @param I2Cx I2C模块指针，指向I2C_TypeDef结构体
 */
void I2C_MasterTxFIFOReset(I2C_TypeDef *I2Cx)
{
    I2Cx->MCR0_f.TXFIFORST = 1;
    I2Cx->MCR0_f.TXFIFORST = 0;
}

/**
 * @brief 重置I2C从机接收FIFO
 *
 * 该函数用于重置指定I2C从机的接收FIFO。
 *
 * @param I2Cx I2C控制器指针，指向要操作的I2C控制器。
 */
void I2C_MasterRxFIFOReset(I2C_TypeDef *I2Cx)
{
    I2Cx->MCR0_f.RXFIFORST = 1;
    I2Cx->MCR0_f.RXFIFORST = 0;
}

/**
 * @brief 重置I2C从机发送FIFO
 *
 * 该函数用于重置I2C从机的发送FIFO。
 * 写 1 复位发送 FIFO,FIFO 复位后，该 FIFO 为空。
 *
 * @param I2Cx I2C设备指针
 */
void I2C_SlaveTxFIFOReset(I2C_TypeDef *I2Cx)
{
    I2Cx->SCR0_f.TXFIFORST = 1;
    I2Cx->SCR0_f.TXFIFORST = 0;
}

/**
 * @brief 重置I2C从机接收FIFO
 *
 * 重置指定的I2C从机接收FIFO。
 * 写 1 复位接收数据寄存器。数据寄存器复位后，该数据寄存器为空。
 *
 * @param I2Cx I2C设备指针
 */
void I2C_SlaveRxFIFOReset(I2C_TypeDef *I2Cx)
{
    I2Cx->SCR0_f.RXFIFORST = 1;
    I2Cx->SCR0_f.RXFIFORST = 0;
}

/**
 * @brief 设置I2C总线滤波器
 *
 * 该函数用于设置I2C总线的SDA和SCL滤波器的值。
 *
 * @param SDAFilter SDA滤波器的值，取值范围为0到15
 * @param SCLFilter SCL滤波器的值，取值范围为0到15
 *
 * @return 无返回值
 *
 * @note 调用此函数前需确保SDAFilter和SCLFilter的值小于16，否则会触发断言失败
 */
void I2C_MasterBusFilter(I2C_TypeDef *I2Cx, uint8_t SDAFilter, uint8_t SCLFilter)
{
    assert_param(SDAFilter < 16);
    assert_param(SCLFilter < 16);
    REGBITS_MODIFY(I2Cx->MCR3, I2Cx_MCR3_FLTSDA_Msk | I2Cx_MCR3_FLTSCL_Msk,
                   ((SDAFilter & 0x0F) << I2Cx_MCR3_FLTSDA_Pos) | ((SCLFilter & 0x0F) << I2Cx_MCR3_FLTSCL_Pos));
}

/**
 * @brief 设置I2C从设备总线滤波参数
 *
 * 该函数用于设置I2C从设备的SDA和SCL线的滤波参数，以提高通信的稳定性。
 *
 * @param SDAFilter SDA线的滤波参数，取值范围为0到15。
 * @param SCLFilter SCL线的滤波参数，取值范围为0到15。
 *
 * @note SDAFilter和SCLFilter的值必须小于16，否则会触发断言错误。
 * 如果SDAFilter的值小于SCLFilter，则SDAFilter将被设置为SCLFilter的值。
 *
 * @retval 无返回值
 */
void I2C_SlaveBusFilter(I2C_TypeDef *I2Cx, uint8_t SDAFilter, uint8_t SCLFilter)
{
    assert_param(SDAFilter < 16);
    assert_param(SCLFilter < 16);

    if (SDAFilter < SCLFilter)
    {
        SDAFilter = SCLFilter;
    }

