JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
    REGBITS_MODIFY(I2Cx->SCR3, I2Cx_SCR3_FLTSDA_Msk | I2Cx_SCR3_FLTSCL_Msk,
                   ((SDAFilter & 0x0F) << I2Cx_SCR3_FLTSDA_Pos) | ((SCLFilter & 0x0F) << I2Cx_SCR3_FLTSCL_Pos));
}

/**
 * @brief 使能或禁用I2C主模式接收数据匹配功能
 *
 * @param I2Cx I2C模块指针，指向要操作的I2C模块
 * @param NewState 功能状态，使能或禁用接收数据匹配功能
 *        - ENABLE: 使能接收数据匹配功能
 *        - DISABLE: 禁用接收数据匹配功能
 *
 * @return 无
 *
 * @note 在调用此函数之前，请确保已经正确初始化了I2C模块。
 */
void I2C_MasterRxDataMatch(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    // 获取当前状态
    FunctionalState CurrentState = (I2Cx->MCR1_f.RDMO == 1) ? ENABLE : DISABLE;

    // 如果状态需要改变
    if (CurrentState != NewState)
    {
        // 确保临界区安全
        __disable_irq(); // 禁用全局中断，防止竞态条件

        if (NewState == ENABLE)
        {
            /* 从禁止更改为使能时，先清除 MICR.MATCH 标志再使能 RDMO */
            I2Cx->MICR_f.MATCH = 0;
            I2Cx->MCR1_f.RDMO = 1;
        }
        else
        {
            /* 从使能更改为禁止时，先禁止 RDMO 再清除 MICR.MATCH 标志 */
            I2Cx->MCR1_f.RDMO = 0;
            I2Cx->MICR_f.MATCH = 0;
        }

        __enable_irq(); // 恢复全局中断
    }
}

/**
 * @brief 设置I2C主设备发送FIFO自动加载功能
 *
 * @param I2Cx I2C设备指针，指向要操作的I2C设备
 * @param NewState 新的功能状态，ENABLE表示启用，DISABLE表示禁用
 *
 * @retval 无
 */
void I2C_MasterTxFIFO_Autoload(I2C_TypeDef *I2Cx, FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE)
    {
        I2Cx->MCR1_f.CIRFIFO = 1;
    }
    else
    {
        I2Cx->MCR1_f.CIRFIFO = 0;
    }
}

/**
 * @brief 初始化I2C主机配置结构
 *
 * 初始化I2C主机配置结构，并将其设置为默认配置。
 *
 * @param masterConfig 指向I2C_MasterConfigTypeDef类型的指针，指向需要初始化的配置结构
 */
void I2C_MasterInitDefault(I2C_MasterConfigTypeDef *masterConfig)
{
    /* Initializes the configure structure to zero. */
    (void)memset(masterConfig, 0, sizeof(*masterConfig));

    masterConfig->I2C_BaudRate_Hz = 400000U;
    masterConfig->I2C_ClockSouce = I2C_CLK_SRC_PCLK;
    masterConfig->I2C_DataMatchMode = I2C_ByteMatch_Prohibit;
    masterConfig->I2C_PinsConfig = 0;
    masterConfig->I2C_SDA_Source = I2C_SDA_INSRC_GPIO;
    masterConfig->I2C_SCL_Source = I2C_SCL_INSRC_GPIO;
    masterConfig->I2C_InDebugState = FALSE;
    masterConfig->I2C_InDeepSleepState = TRUE;
    masterConfig->I2C_RxDataMatch = FALSE;
    masterConfig->I2C_TxFIFO_Autoload = FALSE;
    masterConfig->ignoreAck = FALSE;
    masterConfig->sclGlitchFilterWidth_ns = 0; /* Set to 0 to disable the function */
    masterConfig->sdaGlitchFilterWidth_ns = 0;
    masterConfig->busIdleTimeout_ns = 0;
    masterConfig->pinLowTimeout_ns = 0;
    masterConfig->hostRequest.enable = FALSE;
    masterConfig->hostRequest.source = kLPI2C_HostRequestExternalPin;
    masterConfig->hostRequest.polarity = kLPI2C_HostRequestPinActiveHigh;
}

/**
 * @brief 初始化I2C从设备配置
 *
 * 初始化I2C从设备的配置结构，将其重置为默认值。
 *
 * @param slaveConfig 指向I2C_SlaveConfigTypeDef结构的指针，用于存储从设备配置
 */
void I2C_SlaveInitDefault(I2C_SlaveConfigTypeDef *slaveConfig)
{
    /* Initializes the configure structure to zero. */
    (void)memset(slaveConfig, 0, sizeof(*slaveConfig));

    slaveConfig->addressMatchMode = I2C_Addr0_7bit;
    slaveConfig->I2C_Addr0 = 0x00;
    slaveConfig->I2C_Addr1 = 0x00;
    slaveConfig->I2C_ClockSouce = I2C_CLK_SRC_PCLK_SLV;
    slaveConfig->I2C_RegAddr = I2C_REG_ADDR_8BIT;
    slaveConfig->filterEnable = TRUE;
    slaveConfig->enableGeneralCall = FALSE;
    slaveConfig->sclStall.enableAck = FALSE;
    slaveConfig->sclStall.enableTx = TRUE;
    slaveConfig->sclStall.enableRx = TRUE;
    slaveConfig->sclStall.enableAddress = FALSE;
    slaveConfig->ignoreAck = FALSE;
    slaveConfig->enableReceivedAddressRead = FALSE;
    slaveConfig->sdaGlitchFilterWidth_ns = 0U; /* Set to 0 to disable the function */
    slaveConfig->sclGlitchFilterWidth_ns = 0U;
    slaveConfig->dataValidDelay_ns = 0U;
    /* When enabling the slave tx SCL stall, set the default clock hold time to 250ns according
       to I2C spec for standard mode baudrate(100k). User can manually change it to 100ns or 50ns
       for fast-mode(400k) or fast-mode+(1M). */
    slaveConfig->clockHoldTime_ns = 100U; //Default fast-mode(400k)
}

/**
 * @brief 从EEPROM读取数据
 *
 * 通过I2C总线从EEPROM读取指定地址的数据。
 *
 * @param I2Cx I2C接口指针
 * @param regAddr EEPROM中的起始地址
 * @param regAddrType 地址类型，用于指定地址的长度和格式
 * @param pu8Data 存储读取数据的缓冲区指针
 * @param u16Len 要读取的数据长度
 *
 * @return 读取操作的状态码，成功为0，失败为非0
 */
uint8_t I2C_MasterReadEepromData(I2C_TypeDef *I2Cx, uint32_t regAddr, I2C_SlaveRegAddrTypeDef regAddrType, uint8_t *pu8Data, uint16_t u16Len)
{
    uint8_t u8State;
    uint8_t dataTemp[4];
    uint8_t j;

    switch (regAddrType)
    {
    case I2C_REG_ADDR_8BIT:
        j = 1;
        break;
    case I2C_REG_ADDR_16BIT:
        j = 2;
        break;
    case I2C_REG_ADDR_24BIT:
        j = 3;
        break;
    case I2C_REG_ADDR_32BIT:
        j = 4;
        break;
    default:
        return I2C_Status_Error;
    }

    for (uint8_t i = 0; i < j; i++)
    {
        dataTemp[i] = (uint8_t)((regAddr >> (8 * (j - 1 - i))) & 0xFF); //MSB first
    }

    u8State = I2C_MasterReceiveDataFromSlave(I2Cx, I2C_SLAVEADDRESS_EEPROM, dataTemp, regAddrType, pu8Data, u16Len);
    return u8State;
}

/**
 * @brief 向EEPROM写入数据
 *
 * 通过I2C总线向EEPROM写入数据。
 *
 * @param I2Cx I2C总线接口指针
 * @param regAddr EEPROM寄存器地址
 * @param regAddrType 寄存器地址类型
 * @param pu8Data 待写入的数据指针
 * @param u16Len 待写入的数据长度
 *
 * @return 函数执行状态，返回I2C_Status_OK表示成功，否则表示失败
 */
uint8_t I2C_MasterWriteEepromData(I2C_TypeDef *I2Cx, uint32_t regAddr, I2C_SlaveRegAddrTypeDef regAddrType, uint8_t *pu8Data, uint16_t u16Len)
{
    if (I2Cx == NULL || pu8Data == NULL || u16Len == 0 || u16Len > MAX_DATA_LEN_EEPROM)
    {
        return I2C_Status_Error;
    }

    uint8_t dataTemp[4 + MAX_DATA_LEN_EEPROM];
    uint8_t j;

    switch (regAddrType)
    {
    case I2C_REG_ADDR_8BIT:
        j = 1;
        break;
    case I2C_REG_ADDR_16BIT:
        j = 2;
        break;
    case I2C_REG_ADDR_24BIT:
        j = 3;
        break;
    case I2C_REG_ADDR_32BIT:
        j = 4;
        break;
    default:
        return I2C_Status_Error;
    }

    for (uint8_t i = 0; i < j; i++)
    {
        dataTemp[i] = (uint8_t)((regAddr >> (8 * (j - 1 - i))) & 0xFF); //MSB first
    }

    memcpy(dataTemp + j, pu8Data, u16Len);
    return I2C_MasterSendDataToSlave(I2Cx, I2C_SLAVEADDRESS_EEPROM, dataTemp, u16Len + j);
}

/**
 * @brief 向I2C从设备发送数据,查询方式。
 *
 * 使用I2C总线向指定的从设备发送数据。
 *
 * @param I2Cx I2C模块指针，指向具体的I2C模块
 * @param slaveAddr 从设备地址，支持7位和10位地址
 * @param pu8Data 指向要发送的数据的指针
 * @param u16Len 要发送的数据长度
 *
 * @return 发送状态，成功返回I2C_Status_Success，失败返回I2C_Status_Error或其他错误码
 */
uint8_t I2C_MasterSendDataToSlave(I2C_TypeDef *I2Cx, uint16_t slaveAddr, uint8_t *pu8Data, uint16_t u16Len)
{
    uint8_t u8State;

    // 检查输入参数的有效性
    if (I2Cx == NULL || pu8Data == NULL || u16Len == 0 || slaveAddr > MAX_SLAVE_ADDR_10B)
    {
        return I2C_Status_Error;
    }

