JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
    // 根据从机地址长度选择对应的起始信号和地址发送函数
    if (slaveAddr & I2C_SLAVE_ADDR10B_MSB_MASK)
    {
        // 10-bit地址
        u8State = I2C_MasterSTART_Addr10b(I2Cx, slaveAddr, I2C_MODE_WRITE);
    }
    else
    {
        // 7-bit地址
        u8State = I2C_MasterSTART_Addr7b(I2Cx, (uint8_t)slaveAddr, I2C_MODE_WRITE);
    }

    if (u8State != I2C_Status_Success)
    {
        return u8State;
    }

    // 发送数据: N Byte address + User data, N = 0 ~ 2.
    u8State = I2C_MasterSend(I2Cx, pu8Data, u16Len);

    if (u8State != I2C_Status_Success)
    {
        // 出错时发送停止信号
        I2C_MasterSTOP(I2Cx);
        return u8State;
    }

    // 发送停止信号并返回成功状态
    u8State = I2C_MasterSTOP(I2Cx);
    return u8State;
}

/**
 * @brief 从I2C从设备接收数据
 *
 * 该函数通过I2C接口从指定的从设备读取数据:顺序读方式
 *
 * @param I2Cx I2C模块指针
 * @param slaveAddr 从设备地址
 * @param pu8RegAddr 数据寄存器的地址指针
 * @param regAddrType 寄存器地址类型（8位或16位）
 * @param pu8Data 接收数据的缓冲区指针
 * @param u16Len 要接收的数据长度
 *
 * @return 返回I2C操作状态，成功返回I2C_Status_Success，否则返回相应的错误代码
 */
uint8_t I2C_MasterReceiveDataFromSlave(I2C_TypeDef *I2Cx, uint16_t slaveAddr, uint8_t *pu8RegAddr, I2C_SlaveRegAddrTypeDef regAddrType, uint8_t *pu8Data, uint16_t u16Len)
{
    uint8_t u8State;
    uint8_t j;

    // 检查输入参数的有效性
    if (I2Cx == NULL || pu8Data == NULL || u16Len == 0 || slaveAddr > MAX_SLAVE_ADDR_10B || pu8RegAddr == NULL)
    {
        return I2C_Status_Error;
    }

    // 根据从机地址长度选择对应的起始信号和地址发送函数
    if (slaveAddr & I2C_SLAVE_ADDR10B_MSB_MASK)
    {
        // 10-bit地址
        u8State = I2C_MasterSTART_Addr10b(I2Cx, slaveAddr, I2C_MODE_WRITE);
    }
    else
    {
        // 7-bit地址
        u8State = I2C_MasterSTART_Addr7b(I2Cx, (uint8_t)slaveAddr, I2C_MODE_WRITE);
    }

    if (u8State != I2C_Status_Success)
    {
        return u8State;
    }

    // 发送Data地址
    switch (regAddrType)
    {
    case I2C_REG_ADDR_8BIT:
        j = 1;
        break;
    case I2C_REG_ADDR_16BIT:
        j = 2;
        break;
    case I2C_REG_ADDR_24BIT:
        j = 3;
        break;
    case I2C_REG_ADDR_32BIT:
        j = 4;
        break;
    default:
        return I2C_Status_Error;
    }

    u8State = I2C_MasterSend(I2Cx, pu8RegAddr, j);
    if (u8State != I2C_Status_Success)
    {
        // 出错时发送停止信号
        I2C_MasterSTOP(I2Cx);
        return I2C_Status_Error;
    }

#if 1
    /*
    *Tip: It is advisable to adjust the delay-time prior to issuing the I2C ReSTART-cmd based on factors such as:
    *the MCU's HCLK, the I2C's bps, the compiler used, and the level of optimization.
    */
    FirmwareDelay(2000); // delay approximately 340us@48MHz & 100k bps
#endif

    // 发送重复起始信号和从机地址（读模式）
    if (slaveAddr & I2C_SLAVE_ADDR10B_MSB_MASK)
    {
        // 10-bit地址
        u8State = I2C_MasterReSTART_Addr10b(I2Cx, slaveAddr, I2C_MODE_READ);
    }
    else
    {
        // 7-bit地址
        u8State = I2C_MasterReSTART_Addr7b(I2Cx, (uint8_t)slaveAddr, I2C_MODE_READ);
    }

    if (u8State != I2C_Status_Success)
    {
        return u8State;
    }

    // 接收数据
    u8State = I2C_MasterReceive(I2Cx, pu8Data, u16Len);

    if (u8State != I2C_Status_Success)
    {
        // 出错时发送停止信号
        I2C_MasterSTOP(I2Cx);
        return I2C_Status_Error;
    }

    // 发送停止信号并返回成功状态
    u8State = I2C_MasterSTOP(I2Cx);
    return u8State;
}

/**
 * @brief I2C从设备接收数据
 *
 * 指定的I2C从设备接收数据，并将接收到的数据存储到提供的缓冲区中。
 *
 * @param I2Cx I2C设备指针
 * @param rxBuff 存储接收数据的缓冲区指针
 * @param rxSize 存储接收数据量的指针
 *
 * @return 接收状态，成功返回I2C_Status_Success，错误则返回相应的错误状态
 * - I2C_Status_Error：函数参数无效
 * - I2C_Status_FifoError：缓冲区即将溢出
 * - I2C_Status_Timeout：接收超时
 */
uint8_t I2C_SlaveReceive(I2C_TypeDef *I2Cx, uint8_t *rxBuff, uint16_t *rxSize)
{
    uint8_t *buf;
    uint32_t cntRx = 0;
    uint32_t timeout = I2C_WAIT_TIMEOUT; // 使用定义的超时值，便于调整

    if ((I2Cx == NULL) || (rxBuff == NULL) || (rxSize == NULL))
    {
        return I2C_Status_Error;
    }

    buf = rxBuff;

    while (timeout--)
    {
        uint8_t flagStatus = I2C_SlavePollingFlag(I2Cx, I2C_IT_RXNE_SLV | I2C_IT_STOP_SLV | I2C_IT_RESTART_SLV);

        if (flagStatus == I2C_Status_Success)
        {
            if (I2C_SlaveGetFlag(I2Cx, I2C_IT_RXNE_SLV))
            {
                if (cntRx >= MAX_DATA_LEN_RX)
                {
                    // 缓冲区即将溢出，停止接收并返回错误
                    *rxSize = cntRx;
                    return I2C_Status_FifoError;
                }

                *buf++ = (uint8_t)I2Cx->SRDR;
                cntRx++;
            }
            else
            {
                // 存在 STOP 或 RESTART 标志位，接收结束
                *rxSize = cntRx;
                return I2C_Status_Success;
            }
        }
        else if (timeout == 0)
        {
            // 超时，返回当前接收的数据量
            *rxSize = cntRx;
            return I2C_Status_Timeout;
        }
    }

    // 如果退出循环不是因为成功接收或超时，则返回错误状态
    *rxSize = cntRx;
    return I2C_Status_Error;
}

/**
 * @brief I2C从设备发送数据
 *
 * 该函数用于从设备通过指定的I2C总线向主机发送数据。
 *
 * @param I2Cx I2C总线实例指针
 * @param txBuff 指向要发送数据的缓冲区指针
 * @param txSize 要发送的数据字节数
 *
 * @return 发送状态，成功返回I2C_Status_Success，失败返回相应的错误代码
 *         - I2C_Status_Error: 输入参数无效
 *         - I2C_Status_Timeout: 发送数据时发生超时
 */
uint8_t I2C_SlaveSend(I2C_TypeDef *I2Cx, uint8_t *txBuff, uint16_t txSize)
{
    uint8_t *buf;

    // 检查输入参数
    if (txBuff == NULL || txSize == 0)
    {
        return I2C_Status_Error;
    }

    buf = txBuff;

    while (txSize--)
    {
        // 等待TXE标志位被置位，表示发送缓冲区空闲
        if (I2C_SlavePollingFlag(I2Cx, I2C_IT_TXE_SLV) != I2C_Status_Success)
        {
            return I2C_Status_Timeout; // 超时错误
        }

        // 发送数据
        I2Cx->STDR = *buf++;
    }

    return I2C_Status_Success;
}

/**
 * @brief 清除I2C从机标志位
 *
 * 该函数用于清除指定的I2C从机标志位。
 *
 * @param I2Cx 指向I2C外设的指针
 * @param I2C_FLAG 要清除的I2C从机标志位，可以是以下值之一及其组合：
 *                 - I2C_IT_FIFO_SLV
 *                 - I2C_IT_BIT_SLV
 *                 - I2C_IT_STOP_SLV
 *                 - I2C_IT_RESTART_SLV
 *
 * @return 无返回值
 */
void I2C_SlaveClearFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_CLEAR_FLAG_SLV(I2C_FLAG));

    REGBITS_CLR(I2Cx->SICR, I2C_FLAG);
}

/**
 * @brief 轮询I2C从机状态标志位
 *
 * 此函数用于轮询指定的I2C从机状态标志位，并根据输入参数决定是等待标志位被设置还是清除。
 *
 * @param I2Cx I2C外设指针
 * @param I2C_FLAG 需要轮询的标志位，可以是以下值之一及其组合：
 *                 - I2C_IT_BUSBUSY_SLV
 *                 - I2C_IT_SLVBUSY_SLV
 *                 - I2C_IT_ALERT_SLV
 *                 - I2C_IT_GC_SLV
 *                 - I2C_IT_AM1_SLV
 *                 - I2C_IT_AM0_SLV
 *                 - I2C_IT_FIFO_SLV
 *                 - I2C_IT_BIT_SLV
 *                 - I2C_IT_STOP_SLV
 *                 - I2C_IT_RESTART_SLV
 *                 - I2C_IT_TACK_SLV
 *                 - I2C_IT_ADDR_SLV
 *                 - I2C_IT_RXNE_SLV
 *                 - I2C_IT_TXE_SLV
 *
 * @param reverse 标志位检测逻辑：TRUE表示等待标志位清除，FALSE表示等待标志位设置
 *
 * @return 返回状态码：
 *         - I2C_Status_Success：成功检测到标志位状态
 *         - I2C_Status_Timeout：轮询超时，未检测到标志位状态
 */
static uint8_t I2C_SlavePollingFlagCommon(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG, boolean_t reverse)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_FLAG_SLV(I2C_FLAG));

