JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
    for (uint32_t waitTimes = I2C_WAIT_TIMEOUT; waitTimes > 0; --waitTimes)
    {
        uint32_t regVal = I2Cx->SISR;
        uint32_t flagDetected = reverse ? !(regVal & I2C_FLAG) : (regVal & I2C_FLAG);

        if (flagDetected)
        {
            return I2C_Status_Success;
        }
    }

    return I2C_Status_Timeout;
}

/**
 * @brief 轮询从机I2C标志位
 *
 * 轮询指定的I2C标志位，如果标志位被设置则返回1，否则返回0。
 *
 * @param I2Cx I2C接口指针
 * @param I2C_FLAG 需要轮询的标志位
 *
 * @return 如果标志位被设置，则返回I2C_Status_Success；否则返回I2C_Status_Timeout
 */
uint8_t I2C_SlavePollingFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    return I2C_SlavePollingFlagCommon(I2Cx, I2C_FLAG, FALSE);
}

/**
 * @brief 反转I2C从设备轮询标志位
 *
 * 该函数用于反转I2C从设备的轮询标志位。
 *
 * @param I2Cx I2C外设指针
 * @param I2C_FLAG 要轮询的标志位
 *
 * @return 反转后的标志位状态，I2C_Status_Success表示未触发，I2C_Status_Timeout表示已触发
 */
uint8_t I2C_SlavePollingFlagReverse(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    return I2C_SlavePollingFlagCommon(I2Cx, I2C_FLAG, TRUE);
}

/**
 * @brief 获取I2C从设备标志位状态
 *
 * 根据提供的I2C外设和标志位，获取并返回该标志位的状态。
 *
 * @param I2Cx 指向I2C外设的指针
 * @param I2C_FLAG 要检查的I2C从设备标志位
 *
 * @return 如果标志位被设置，则返回非零值；否则返回0
 *
 */
uint32_t I2C_SlaveGetFlag(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_FLAG_SLV(I2C_FLAG));

    // 获取并返回指定的标志位状态
    return (I2Cx->SISR & I2C_FLAG);
}

/**
 * @brief 设置 I2C 从机在发送响应阶段是否发出 NACK
 *
 * @param I2Cx 指向 I2C 模块的指针
 * @param stateNAck 是否发出 NACK 的状态
 *     - ENABLE: 从机在发送响应阶段发出 NACK
 *     - DISABLE: 从机在发送响应阶段发出 ACK
 */
void I2C_SlaveTxNAck(I2C_TypeDef *I2Cx, FunctionalState stateNAck)
{
    if (stateNAck == ENABLE)
    {
        REGBITS_SET(I2Cx->STAR, I2Cx_STAR_TXNACK_Msk); // 从机在发送响应阶段，发出 NACK
    }
    else
    {
        REGBITS_CLR(I2Cx->STAR, I2Cx_STAR_TXNACK_Msk); // 从机在发送响应阶段，发出 ACK
    }
}

/**
 * @brief 根据给定的时钟频率、脉冲宽度、最小和最大周期数以及预分频器计算I2C总线上的周期数
 *
 * @param sourceClock_Hz 源时钟频率（Hz）
 * @param width_ns 脉冲宽度（纳秒）
 * @param minCycles 最小周期数
 * @param maxCycles 最大周期数
 * @param prescaler 预分频器值
 *
 * @return 计算出的周期数
 *
 * @note 确保sourceClock_Hz大于0
 */
static uint32_t I2C_GetCyclesForWidth(
    uint32_t sourceClock_Hz, uint32_t width_ns, uint32_t minCycles, uint32_t maxCycles, uint32_t prescaler)
{
    assert_param(sourceClock_Hz > 0U);

    uint32_t divider = 1U;

    while (prescaler != 0U)
    {
        divider *= 2U;
        prescaler--;
    }

    uint32_t busCycle_ns = 1000000U / (sourceClock_Hz / divider / 1000U);
    /* Calculate the cycle count, round up the calculated value. */
    uint32_t cycles = (width_ns * 10U / busCycle_ns + 5U) / 10U;

    /* If the calculated value is smaller than the minimum value, use the minimum value */
    if (cycles < minCycles)
    {
        cycles = minCycles;
    }

    /* If the calculated value is larger than the maximum value, use the maxmum value */
    if (cycles > maxCycles)
    {
        cycles = maxCycles;
    }

    return cycles;
}

/**
 * @brief 设置I2C主机模式的波特率
 *
 * @param I2Cx I2C接口指针，指向I2C_TypeDef结构体
 * @param sourceClock_Hz I2C接口时钟源频率（单位：Hz）
 * @param baudRate_Hz 期望的波特率（单位：Hz）
 *
 * @note 在设置波特率之前，会先禁用I2C主模式，设置完成后会恢复I2C主模式。
 */
void I2C_MasterSetBaudRate(I2C_TypeDef *I2Cx, uint32_t sourceClock_Hz, uint32_t baudRate_Hz)
{
    boolean_t wasEnabled;
    uint8_t filtScl = (uint8_t)((I2Cx->MCR3 & I2Cx_MCR3_FLTSCL_Msk) >> I2Cx_MCR3_FLTSCL_Pos);

    uint8_t divider = 1U;
    uint8_t bestDivider = 1U;
    uint8_t prescale = 0U;
    uint8_t bestPre = 0U;

    uint8_t clkCycle;
    uint8_t bestclkCycle = 0U;

    uint32_t absError = 0U;
    uint32_t bestError = 0xffffffffu;
    uint32_t computedRate;

    uint32_t tmpReg = 0U;

    /* Disable master mode. */
    wasEnabled = (0U != ((I2Cx->MCR0 & I2Cx_MCR0_MEN_Msk) >> I2Cx_MCR0_MEN_Pos));
    I2C_MasterCmd(I2Cx, DISABLE);

    for (prescale = 0U; prescale <= 7U; prescale++)
    {
        /* Calculate the clkCycle, clkCycle = CLKLO + CLKHI, divider = 2 ^ prescale */
        clkCycle = (uint8_t)((10U * sourceClock_Hz / divider / baudRate_Hz + 5U) / 10U - (2U + filtScl) / divider - 2U);

        if (clkCycle > (120U - (2U + filtScl) / divider))
        {
            divider *= 2U;
            continue;
        }

        /* Calculate the computed baudrate and compare it with the desired baudrate */
        computedRate = (sourceClock_Hz / (uint32_t)divider) /
                       ((uint32_t)clkCycle + 2U + (2U + (uint32_t)filtScl) / (uint32_t)divider);
        absError = baudRate_Hz > computedRate ? baudRate_Hz - computedRate : computedRate - baudRate_Hz;

        if (absError < bestError)
        {
            bestPre = prescale;
            bestDivider = divider;
            bestclkCycle = clkCycle;
            bestError = absError;

            /* If the error is 0, then we can stop searching because we won't find a better match. */
            if (absError == 0U)
            {
                break;
            }
        }

        divider *= 2U;
    }

    uint8_t tmpHigh = (bestclkCycle - (2U + filtScl) / bestDivider) / 2U;

    while (tmpHigh > (bestclkCycle - 52U * sourceClock_Hz / baudRate_Hz / bestDivider / 100U + 1U))
    {
        tmpHigh = tmpHigh - 1U;
    }

    /* Calculate DATAVD and SETHOLD.
       To meet the timing requirement of I2C spec for standard mode, fast mode and fast mode plus: */
    uint8_t tmpHold = (uint8_t)(sourceClock_Hz / baudRate_Hz / bestDivider / 2U) - 1U;

    uint8_t tmpDataVd = (uint8_t)(sourceClock_Hz / baudRate_Hz / bestDivider / 4U) - 1U;

    if ((sourceClock_Hz / baudRate_Hz / 20U) > (bestDivider + 2U))
    {
        /* Read out the FILTSDA configuration, if it is smaller than expected, change the setting. */
        uint8_t filtSda = (uint8_t)((I2Cx->MCR3 & I2Cx_MCR3_FLTSDA_Msk) >> I2Cx_MCR3_FLTSDA_Pos);

        if (filtSda < (sourceClock_Hz / baudRate_Hz / 20U - bestDivider - 2U))
        {
            filtSda = (uint8_t)(sourceClock_Hz / baudRate_Hz / 20U) - bestDivider - 2U;
        }

        I2Cx->MCR3 = (I2Cx->MCR3 & ~I2Cx_MCR3_FLTSDA_Msk) | I2C_MCR3_FILTSDA(filtSda);
    }

