JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
    /* Set CLKHI, CLKLO, SETHOLD, DATAVD value. */
    tmpReg = I2C_MCCR0_CLKHI((uint32_t)tmpHigh) |
             I2C_MCCR0_CLKLO((uint32_t)((uint32_t)bestclkCycle - (uint32_t)tmpHigh)) |
             I2C_MCCR0_SETHOLD((uint32_t)tmpHold) | I2C_MCCR0_DATAVD((uint32_t)tmpDataVd);
    I2Cx->MCCR = tmpReg;

    /* Set PRESCALE value. */
    I2Cx->MCR2 = (I2Cx->MCR2 & ~I2Cx_MCR2_PRESCALE_Msk) | I2C_MCR2_PRESCALE(bestPre);

    /* Restore master mode. */
    if (wasEnabled)
    {
        I2C_MasterCmd(I2Cx, ENABLE);
    }
}

/**
 * @brief 获取LPI2C实例编号
 *
 * 根据给定的I2C类型指针获取其对应的LPI2C实例编号。
 *
 * @param I2Cx I2C类型指针
 *
 * @return 返回LPI2C实例编号，如果找不到对应的实例则返回超出范围的编号
 */
uint32_t LPI2C_GetInstance(I2C_TypeDef *I2Cx)
{
    uint32_t instance;
    for (instance = 0U; instance < ARRAY_SZ(kLpi2cBases); ++instance)
    {
        if (kLpi2cBases[instance] == I2Cx)
        {
            break;
        }
    }

    assert_param(instance < ARRAY_SZ(kLpi2cBases));
    return instance;
}

/**
 * @brief 检查并清除LPI2C主机错误
 *
 * 检查并清除LPI2C主机错误。在发生错误时，将自动发送停止信号。必须清除错误才能开始新的传输。
 *
 * @param I2Cx LPI2C模块指针
 * @param status LPI2C状态标志
 *
 * @return 返回状态码。成功返回kStatus_Success，错误返回对应的错误码。
 */
status_t LPI2C_MasterCheckAndClearError(I2C_TypeDef *I2Cx, uint32_t status)
{
    status_t result = kStatus_Success;

    /* Check for error. These errors cause a stop to automatically be sent. We must */
    /* clear the errors before a new transfer can start. */
    status &= (uint32_t)kLPI2C_MasterErrorFlags;
    if (0U != status)
    {
        /* Select the correct error code. Ordered by severity, with bus issues first. */
        if (0U != (status & (uint32_t)kLPI2C_MasterPinLowTimeoutFlag))
        {
            result = kStatus_LPI2C_PinLowTimeout;
        }
        else if (0U != (status & (uint32_t)kLPI2C_MasterArbitrationLostFlag))
        {
            result = kStatus_LPI2C_ArbitrationLost;
        }
        else if (0U != (status & (uint32_t)kLPI2C_MasterNackDetectFlag))
        {
            result = kStatus_LPI2C_Nak;
        }
        else if (0U != (status & (uint32_t)kLPI2C_MasterFifoErrFlag))
        {
            result = kStatus_LPI2C_FifoError;
        }
        else
        {
            ; /* Intentional empty */
        }

        /* Clear the flags. */
        I2C_MasterClearFlag(I2Cx, status);

        /* Reset fifos. These flags clear automatically. */
        I2Cx->MCR0 |= I2Cx_MCR0_RXFIFORST_Msk | I2Cx_MCR0_TXFIFORST_Msk;
    }
    else
    {
        ; /* Intentional empty */
    }

    return result;
}

/**
 * @brief 等待LPI2C主机发送缓冲区准备就绪
 *
 * 该函数等待直到LPI2C主机的发送缓冲区准备就绪，或者发生错误。
 *
 * @param I2Cx I2C外设地址
 *
 * @return 返回函数执行状态，成功返回kStatus_Success，其他值表示错误。
 */
static status_t LPI2C_MasterWaitForTxReady(I2C_TypeDef *I2Cx)
{
    status_t result = kStatus_Success;
    uint32_t status;
    size_t txCount;
    size_t txFifoSize = (size_t)FSL_FEATURE_I2C_FIFO_SIZEn(I2Cx);

#if I2C_RETRY_TIMES != 0U
    uint32_t waitTimes = I2C_RETRY_TIMES;
#endif
    do
    {
        /* Get the number of words in the tx fifo and compute empty slots. */
        LPI2C_MasterGetFifoCounts(I2Cx, NULL, &txCount);
        txCount = txFifoSize - txCount;

        /* Check for error flags. */
        status = LPI2C_MasterGetStatusFlags(I2Cx);
        result = LPI2C_MasterCheckAndClearError(I2Cx, status);
        if (kStatus_Success != result)
        {
            break;
        }
#if I2C_RETRY_TIMES != 0U
        waitTimes--;
    } while ((0U == txCount) && (0U != waitTimes));

    if (0U == waitTimes)
    {
        result = kStatus_LPI2C_Timeout;
    }
#else
    } while (0U == txCount);
#endif

    return result;
}

/**
 * @brief 检查I2C总线是否繁忙
 *
 * 检查指定的I2C总线是否处于繁忙状态。
 *
 * @param I2Cx I2C模块指针
 *
 * @return 返回状态码
 *         - kStatus_Success: 总线不繁忙
 *         - kStatus_LPI2C_Busy: 总线繁忙
 */
status_t LPI2C_CheckForBusyBus(I2C_TypeDef *I2Cx)
{
    status_t ret = kStatus_Success;

    uint32_t status = LPI2C_MasterGetStatusFlags(I2Cx);
    if ((0U != (status & (uint32_t)kLPI2C_MasterBusBusyFlag)) && (0U == (status & (uint32_t)kLPI2C_MasterBusyFlag)))
    {
        ret = kStatus_LPI2C_Busy;
    }

    return ret;
}

/**
 * @brief I2C 主模式去初始化函数
 *
 * 该函数用于将指定的 I2C 端口从主模式去初始化，恢复到复位状态。
 *
 * @param I2Cx I2C 端口指针，指向要操作的 I2C 端口。
 */
void I2C_MasterDeinit(I2C_TypeDef *I2Cx)
{
    /* Restore to reset state. */
    I2C_MasterSoftReset(I2Cx);

    I2C_DeInit(I2Cx);
}

/**
 * @brief 配置I2C主机模式的数据匹配参数
 *
 * 该函数用于配置I2C主机模式的数据匹配参数。
 *
 * @param I2Cx I2C模块指针，指向要配置的I2C模块
 * @param matchConfig 指向数据匹配配置参数的指针
 */
void LPI2C_MasterConfigureDataMatch(I2C_TypeDef *I2Cx, const lpi2c_data_match_config_t *matchConfig)
{
    /* Disable master mode. */
    boolean_t wasEnabled = (0U != ((I2Cx->MCR0 & I2Cx_MCR0_MEN_Msk) >> I2Cx_MCR0_MEN_Pos));
    I2C_MasterCmd(I2Cx, DISABLE);

    I2Cx->MCR2 = (I2Cx->MCR2 & ~I2Cx_MCR2_MATCFG_Pos) | I2C_MCR2_MATCFG(matchConfig->matchMode);
    I2Cx->MCR1 = (I2Cx->MCR1 & ~I2Cx_MCR1_RDMO_Msk) | I2C_MCR1_RDMO(matchConfig->rxDataMatchOnly);
    I2Cx->MMATCH   = I2C_MDMR_MATCH0(matchConfig->match0) | I2C_MDMR_MATCH1(matchConfig->match1);

    /* Restore master mode. */
    if (wasEnabled)
    {
        I2C_MasterCmd(I2Cx, ENABLE);
    }
}

/**
 * @brief 主设备停止I2C总线传输
 *
 * 停止指定的I2C总线上的数据传输。
 *
 * @param I2Cx I2C设备指针
 *
 * @return 返回状态码，成功返回kStatus_Success，失败返回相应的错误码
 */
status_t LPI2C_MasterStop(I2C_TypeDef *I2Cx)
{
    /* Wait until there is room in the fifo. */
    status_t result = LPI2C_MasterWaitForTxReady(I2Cx);
    if (kStatus_Success == result)
    {
        /* Send the STOP signal */
        I2Cx->MTDR = (uint32_t)kStopCmd;

        /* Wait for the stop detected flag to set, indicating the transfer has completed on the bus. */
        /* Also check for errors while waiting. */
#if I2C_RETRY_TIMES != 0U
        uint32_t waitTimes = I2C_RETRY_TIMES;
#endif

#if I2C_RETRY_TIMES != 0U
        while ((result == kStatus_Success) && (0U != waitTimes))
        {
            waitTimes--;
#else
        while (result == kStatus_Success)
        {
#endif
            uint32_t status = LPI2C_MasterGetStatusFlags(I2Cx);

            /* Check for error flags. */
            result = LPI2C_MasterCheckAndClearError(I2Cx, status);

            /* Check if the stop was sent successfully. */
            if ((0U != (status & (uint32_t)kLPI2C_MasterStopDetectFlag)) &&
                (0U != (status & (uint32_t)kLPI2C_MasterTxReadyFlag)))
            {
                I2C_MasterClearFlag(I2Cx, (uint32_t)kLPI2C_MasterStopDetectFlag);
                break;
            }
        }

#if I2C_RETRY_TIMES != 0U
        if (0U == waitTimes)
        {
            result = kStatus_LPI2C_Timeout;
        }
#endif
    }

    return result;
}

/**
 * @brief 主机从I2C总线上接收数据
 *
 * 从指定的I2C总线上接收数据，并存储到提供的缓冲区中。
 *
 * @param I2Cx I2C设备指针
 * @param rxBuff 用于存储接收到的数据的缓冲区指针
 * @param rxSize 需要接收的数据大小
 *
 * @return 返回状态码，成功返回kStatus_Success，失败返回相应的错误码
 */
status_t LPI2C_MasterReceive(I2C_TypeDef *I2Cx, void *rxBuff, size_t rxSize)
{
    assert_param(NULL != rxBuff);

    status_t result = kStatus_Success;
    uint8_t *buf;
    size_t tmpRxSize = rxSize;
#if I2C_RETRY_TIMES != 0U
    uint32_t waitTimes;
#endif

    /* Check transfer data size. */
    if (rxSize > (256UL * (uint32_t)FSL_FEATURE_I2C_FIFO_SIZEn(I2Cx)))
    {
        return kStatus_InvalidArgument;
    }

    /* Handle empty read. */
    if (rxSize != 0U)
    {
        /* Wait until there is room in the command fifo. */
        result = LPI2C_MasterWaitForTxReady(I2Cx);
        if (kStatus_Success == result)
        {
            /* Issue command to receive data. A single write to MTDR can issue read operation of 0xFFU + 1 byte of data
               at most, so when the rxSize is larger than 0x100U, push multiple read commands to MTDR until rxSize is
               reached. */
            while (tmpRxSize != 0U)
            {
                if (tmpRxSize > 256U)
                {
                    I2Cx->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)I2C_MTDR_DATA(0xFFU);
                    tmpRxSize -= 256U;
                }
                else
                {
                    I2Cx->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)I2C_MTDR_DATA(tmpRxSize - 1U);
                    tmpRxSize  = 0U;
                }
            }

            /* Receive data */
            buf = (uint8_t *)rxBuff;
            while (0U != (rxSize--))
            {
#if I2C_RETRY_TIMES != 0U
                waitTimes = I2C_RETRY_TIMES;
#endif
                /* Read LPI2C receive fifo register. The register includes a flag to indicate whether */
                /* the FIFO is empty, so we can both get the data and check if we need to keep reading */
                /* using a single register read. */
                uint32_t value = 0U;
                do
                {
                    /* Check for errors. */
                    result = LPI2C_MasterCheckAndClearError(I2Cx, LPI2C_MasterGetStatusFlags(I2Cx));
                    if (kStatus_Success != result)
                    {
                        break;
                    }

