JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
                    value = I2Cx->MRDR;
#if I2C_RETRY_TIMES != 0U
                    waitTimes--;
                } while ((0U != (value & I2Cx_MRDR_EMPTY_Msk)) && (0U != waitTimes));
                if (0U == waitTimes)
                {
                    result = kStatus_LPI2C_Timeout;
                }
#else
                } while (0U != (value & I2Cx_MRDR_EMPTY_Msk));
#endif
                if ((status_t)kStatus_Success != result)
                {
                    break;
                }

                *buf++ = (uint8_t)(value & I2Cx_MRDR_DATA_Msk);
            }
        }
    }

    return result;
}

/**
 * @brief 主机向 I2C 总线发送数据
 *
 * 该函数用于通过 I2C 总线发送数据。
 *
 * @param I2Cx I2C 控制器实例指针
 * @param txBuff 指向要发送的数据缓冲区的指针
 * @param txSize 要发送的数据大小（字节数）
 *
 * @return 发送操作的状态码。如果成功，返回 kStatus_Success；否则返回相应的错误代码。
 */
status_t LPI2C_MasterSend(I2C_TypeDef *I2Cx, void *txBuff, size_t txSize)
{
    status_t result = kStatus_Success;
    uint8_t *buf    = (uint8_t *)txBuff;

    assert_param(NULL != txBuff);

    /* Send data buffer */
    while (0U != (txSize--))
    {
        /* Wait until there is room in the fifo. This also checks for errors. */
        result = LPI2C_MasterWaitForTxReady(I2Cx);
        if (kStatus_Success != result)
        {
            break;
        }

        /* Write byte into LPI2C master data register. */
        I2Cx->MTDR = *buf++;
    }

    return result;
}

/**
 * @brief 主机在阻塞模式下通过I2C总线进行主从设备数据传输
 *
 * 该函数在阻塞模式下，通过I2C总线进行主从设备之间的数据传输。它支持读写操作，
 * 并处理数据传输过程中的各种细节，如子地址的发送、数据传输的开始和结束等。
 *
 * @param I2Cx I2C模块的外设基地址指针
 * @param transfer 指向传输配置的指针，包含传输的方向、数据大小、子地址等信息
 *
 * @return 传输状态，成功返回kStatus_Success，失败返回相应的错误代码
 */
status_t LPI2C_MasterTransferBlocking(I2C_TypeDef *I2Cx, lpi2c_master_transfer_t *transfer)
{
    assert_param(NULL != transfer);
    assert_param(transfer->subaddressSize <= sizeof(transfer->subaddress));

    status_t result = kStatus_Success;
    uint16_t commandBuffer[7];
    uint32_t cmdCount = 0U;

    /* Check transfer data size in read operation. */
    if ((transfer->direction == I2C_MODE_READ) &&
        (transfer->dataSize > (256UL * (uint32_t)FSL_FEATURE_I2C_FIFO_SIZEn(I2Cx))))
    {
        return kStatus_InvalidArgument;
    }

    /* Return an error if the bus is already in use not by us. */
    result = LPI2C_CheckForBusyBus(I2Cx);
    if (kStatus_Success == result)
    {
        /* Clear all flags. */
        I2C_MasterClearFlag(I2Cx, (uint32_t)kLPI2C_MasterClearFlags);

        /* Turn off auto-stop option. */
        I2Cx->MCR2 &= ~I2Cx_MCR2_AUTOSTOP_Msk;

        I2C_ModeTypeDef direction = (0U != transfer->subaddressSize) ? I2C_MODE_WRITE : transfer->direction;
        if (0U == (transfer->flags & (uint32_t)kLPI2C_TransferNoStartFlag))
        {
            if (transfer->slaveAddress & I2C_SLAVE_ADDR10B_MSB_MASK)
            {
                //10-bit slave address
                //slave MSB address
                commandBuffer[cmdCount++] =
                    (uint16_t)kStartCmd |
                        (uint16_t)((uint16_t)((((uint16_t)transfer->slaveAddress & I2C_SLAVE_ADDR10B_MSB_MASK) >> (8 - 1)) | I2C_SLAVE_ADDR10B_MSB) | (uint16_t)direction);

                //slave LSB address
                commandBuffer[cmdCount++] =
                    (uint16_t)((uint16_t)transfer->slaveAddress & I2C_SLAVE_ADDR10B_LSB_MASK);
            }
            else
            {
                //7-bit slave address
                commandBuffer[cmdCount++] =
                    (uint16_t)kStartCmd |
                        (uint16_t)((uint16_t)((uint16_t)transfer->slaveAddress << 1U) | (uint16_t)direction);
            }
        }

        /* Subaddress, MSB first. */
        if (0U != transfer->subaddressSize)
        {
            uint32_t subaddressRemaining = transfer->subaddressSize;
            while (0U != subaddressRemaining--)
            {
                uint8_t subaddressByte    = (uint8_t)((transfer->subaddress >> (8U * subaddressRemaining)) & 0xffU);
                commandBuffer[cmdCount++] = subaddressByte;
            }
        }

        /* Reads need special handling. */
        if ((0U != transfer->dataSize) && (transfer->direction == I2C_MODE_READ))
        {
            /* Need to send repeated start if switching directions to read. */
            if (direction == I2C_MODE_WRITE)
            {
                if (transfer->slaveAddress & I2C_SLAVE_ADDR10B_MSB_MASK)
                {
                    //10-bit slave address
                    //slave MSB address
                    commandBuffer[cmdCount++] =
                        (uint16_t)kStartCmd |
                            (uint16_t)((uint16_t)((((uint16_t)transfer->slaveAddress & I2C_SLAVE_ADDR10B_MSB_MASK) >> (8 - 1)) | I2C_SLAVE_ADDR10B_MSB) | (uint16_t)I2C_MODE_READ);
                }
                else
                {
                    //7-bit slave address
                    commandBuffer[cmdCount++] =
                        (uint16_t)kStartCmd |
                            (uint16_t)((uint16_t)((uint16_t)transfer->slaveAddress << 1U) | (uint16_t)I2C_MODE_READ);
                }
            }
        }

        /* Send command buffer */
        uint32_t index = 0U;
        while (0U != cmdCount--)
        {
            /* Wait until there is room in the fifo. This also checks for errors. */
            result = LPI2C_MasterWaitForTxReady(I2Cx);
            if (kStatus_Success != result)
            {
                break;
            }

            /* Write byte into LPI2C master data register. */
            I2Cx->MTDR = commandBuffer[index];
            index++;
        }

        if (kStatus_Success == result)
        {
            /* Transmit data. */
            if ((transfer->direction == I2C_MODE_WRITE) && (transfer->dataSize > 0U))
            {
                /* Send Data. */
                result = LPI2C_MasterSend(I2Cx, transfer->data, transfer->dataSize);
            }

            /* Receive Data. */
            if ((transfer->direction == I2C_MODE_READ) && (transfer->dataSize > 0U))
            {
                result = LPI2C_MasterReceive(I2Cx, transfer->data, transfer->dataSize);
            }

