JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
            if (kStatus_Success == result)
            {
                if ((transfer->flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U)
                {
                    result = LPI2C_MasterStop(I2Cx);
                }
            }
        }
    }

    return result;
}

/**
 * @brief 创建I2C主设备传输句柄
 *
 * 该函数用于初始化并创建一个I2C主设备传输句柄，并设置相关的回调函数和用户数据。
 *
 * @param I2Cx I2C设备实例指针
 * @param handle 指向I2C主设备传输句柄的指针
 * @param callback I2C主设备传输完成的回调函数
 * @param userData 用户自定义数据指针，将传递给回调函数
 */
void LPI2C_MasterTransferCreateHandle(I2C_TypeDef *I2Cx,
                                      lpi2c_master_handle_t *handle,
                                      lpi2c_master_transfer_callback_t callback,
                                      void *userData)
{
    uint32_t instance;

    assert_param(NULL != handle);

    /* Clear out the handle. */
    (void)memset(handle, 0, sizeof(*handle));

    /* Look up instance number */
    instance = LPI2C_GetInstance(I2Cx);

    /* Save base and instance. */
    handle->completionCallback = callback;
    handle->userData           = userData;

    /* Save this handle for IRQ use. */
    s_lpi2cMasterHandle[instance] = handle;

    /* Set irq handler. */
    s_lpi2cMasterIsr = LPI2C_MasterTransferHandleIRQ;

    /* Clear internal IRQ enables and enable NVIC IRQ. */
    LPI2C_MasterDisableInterrupts(I2Cx, (uint32_t)kLPI2C_MasterIrqFlags);

    /* Enable NVIC IRQ, this only enables the IRQ directly connected to the NVIC.*/
    NVIC_ClearPendingIRQ(kLpi2cIrqs[instance]);
    NVIC_EnableIRQ(kLpi2cIrqs[instance]);
}

/**
 * @brief 运行I2C传输状态机
 *
 * 此函数用于控制I2C传输状态机，包括发送命令、发送/接收数据以及发送停止命令等状态。
 *
 * @param I2Cx I2C模块基地址指针
 * @param handle I2C主模式句柄指针
 * @param isDone 用于指示传输是否完成的布尔指针
 *
 * @return 返回状态码，kStatus_Success表示成功，其他值表示错误
 */
static status_t LPI2C_RunTransferStateMachine(I2C_TypeDef *I2Cx, lpi2c_master_handle_t *handle, boolean_t *isDone)
{
    uint32_t status;
    status_t result = kStatus_Success;
    lpi2c_master_transfer_t *xfer;
    size_t txCount;
    size_t rxCount;
    size_t txFifoSize = (size_t)FSL_FEATURE_I2C_FIFO_SIZEn(I2Cx);
    boolean_t state_complete = FALSE;
    uint16_t sendval;

    /* Set default isDone return value. */
    *isDone = FALSE;

    /* Check for errors. */
    status = LPI2C_MasterGetStatusFlags(I2Cx);

    /* Get fifo counts. */
    LPI2C_MasterGetFifoCounts(I2Cx, &rxCount, &txCount);

    /* Get pointer to private data. */
    xfer = &handle->transfer;

    /* For the last byte, nack flag is expected.
       Do not check and clear kLPI2C_MasterNackDetectFlag for the last byte,
       in case FIFO is emptied when stop command has not been sent. */
    if (handle->remainingBytes == 0U)
    {
        /* When data size is not zero which means it is not only one byte of address is sent, and */
        /* when the txfifo is empty, or have one byte which is the stop command, then the nack status can be ignored. */
        if ((xfer->dataSize != 0U) &&
            ((txCount == 0U) || ((txCount == 1U) && (handle->state == (uint8_t)kWaitForCompletionState) &&
                                 ((xfer->flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U))))
        {
            status &= ~(uint32_t)kLPI2C_MasterNackDetectFlag;
        }
    }

    result = LPI2C_MasterCheckAndClearError(I2Cx, status);

    if (kStatus_Success == result)
    {
        /* Compute room in tx fifo */
        txCount = txFifoSize - txCount;

        while (!state_complete)
        {
            /* Execute the state. */
            switch (handle->state)
            {
                case (uint8_t)kSendCommandState:
                    /* Make sure there is room in the tx fifo for the next command. */
                    if (0U == txCount--)
                    {
                        state_complete = TRUE;
                        break;
                    }

                    /* Issue command. buf is a uint8_t* pointing at the uint16 command array. */
                    sendval    = ((uint16_t)handle->buf[0]) | (((uint16_t)handle->buf[1]) << 8U);
                    I2Cx->MTDR = sendval;
                    handle->buf++;
                    handle->buf++;

                    /* Count down until all commands are sent. */
                    if (--handle->remainingBytes == 0U)
                    {
                        /* Choose next state and set up buffer pointer and count. */
                        if (0U != xfer->dataSize)
                        {
                            /* Either a send or receive transfer is next. */
                            handle->state          = (uint8_t)kTransferDataState;
                            handle->buf            = (uint8_t *)xfer->data;
                            handle->remainingBytes = (uint16_t)xfer->dataSize;
                            if (xfer->direction == I2C_MODE_READ)
                            {
                                /* Disable TX interrupt */
                                LPI2C_MasterDisableInterrupts(I2Cx, (uint32_t)kLPI2C_MasterTxReadyFlag);
                                /* Issue command to receive data. A single write to MTDR can issue read operation of
                                   0xFFU + 1 byte of data at most, so when the dataSize is larger than 0x100U, push
                                   multiple read commands to MTDR until dataSize is reached. */
                                size_t tmpRxSize = xfer->dataSize;
                                while (tmpRxSize != 0U)
                                {
                                    LPI2C_MasterGetFifoCounts(I2Cx, NULL, &txCount);
                                    while (txFifoSize == txCount)
                                    {
                                        LPI2C_MasterGetFifoCounts(I2Cx, NULL, &txCount);
                                    }

                                    if (tmpRxSize > 256U)
                                    {
                                        I2Cx->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)I2C_MTDR_DATA(0xFFU);
                                        tmpRxSize -= 256U;
                                    }
                                    else
                                    {
                                        I2Cx->MTDR = (uint32_t)(kRxDataCmd) | (uint32_t)I2C_MTDR_DATA(tmpRxSize - 1U);
                                        tmpRxSize  = 0U;
                                    }
                                }
                            }
                        }
                        else
                        {
                            /* No transfer, so move to stop state. */
                            handle->state = (uint8_t)kStopState;
                        }
                    }
                    break;

                case (uint8_t)kIssueReadCommandState:
                    /* Make sure there is room in the tx fifo for the read command. */
                    if (0U == txCount--)
                    {
                        state_complete = TRUE;
                        break;
                    }

                    I2Cx->MTDR = (uint32_t)kRxDataCmd | I2C_MTDR_DATA(xfer->dataSize - 1U);

                    /* Move to transfer state. */
                    handle->state = (uint8_t)kTransferDataState;
                    if (xfer->direction == I2C_MODE_READ)
                    {
                        /* Disable TX interrupt */
                        LPI2C_MasterDisableInterrupts(I2Cx, (uint32_t)kLPI2C_MasterTxReadyFlag);
                    }
                    break;

                case (uint8_t)kTransferDataState:
                    if (xfer->direction == I2C_MODE_WRITE)
                    {
                        /* Make sure there is room in the tx fifo. */
                        if (0U == txCount--)
                        {
                            state_complete = TRUE;
                            break;
                        }

                        /* Put byte to send in fifo. */
                        I2Cx->MTDR = *(handle->buf)++;
                    }
                    else
                    {
                        /* XXX handle receive sizes > 256, use kIssueReadCommandState */
                        /* Make sure there is data in the rx fifo. */
                        if (0U == rxCount--)
                        {
                            state_complete = TRUE;
                            break;
                        }

