JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
                        /* Read byte from fifo. */
                        *(handle->buf)++ = (uint8_t)(I2Cx->MRDR & I2Cx_MRDR_DATA_Msk);
                    }

                    /* Move to stop when the transfer is done. */
                    if (--handle->remainingBytes == 0U)
                    {
                        if (xfer->direction == I2C_MODE_WRITE)
                        {
                            state_complete = TRUE;
                        }
                        handle->state = (uint8_t)kStopState;
                    }
                    break;

                case (uint8_t)kStopState:
                    /* Only issue a stop transition if the caller requested it. */
                    if ((xfer->flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U)
                    {
                        /* Make sure there is room in the tx fifo for the stop command. */
                        if (0U == txCount--)
                        {
                            state_complete = TRUE;
                            break;
                        }

                        I2Cx->MTDR = (uint32_t)kStopCmd;
                    }
                    else
                    {
                        /* If all data is read and no stop flag is required to send, we are done. */
                        if (xfer->direction == I2C_MODE_READ)
                        {
                            *isDone = TRUE;
                        }
                        state_complete = TRUE;
                    }
                    handle->state = (uint8_t)kWaitForCompletionState;
                    break;

                case (uint8_t)kWaitForCompletionState:
                    if ((xfer->flags & (uint32_t)kLPI2C_TransferNoStopFlag) == 0U)
                    {
                        /* We stay in this state until the stop state is detected. */
                        if (0U != (status & (uint32_t)kLPI2C_MasterStopDetectFlag))
                        {
                            *isDone = TRUE;
                        }
                    }
                    else
                    {
                        /* If all data is pushed to FIFO and no stop flag is required to send, we need to make sure they
                           are all send out to bus. */
                        if ((xfer->direction == I2C_MODE_WRITE) && ((I2Cx->MFIFOSR & I2Cx_MFIFOSR_TXCNT_Msk) == 0U))
                        {
                            /* We stay in this state until the data is sent out to bus. */
                            *isDone = TRUE;
                        }
                    }
                    state_complete = TRUE;
                    break;
                default:
                    assert_param(FALSE);
                    break;
            }
        }
    }
    return result;
}

/**
 * @brief 初始化I2C传输状态机
 *
 * 该函数用于初始化I2C传输状态机，根据传入的参数设置传输的状态、数据和地址等信息。
 *
 * @param handle I2C传输句柄指针
 */
static void LPI2C_InitTransferStateMachine(lpi2c_master_handle_t *handle)
{
    lpi2c_master_transfer_t *xfer = &handle->transfer;

    /* Handle no start option. */
    if (0U != (xfer->flags & (uint32_t)kLPI2C_TransferNoStartFlag))
    {
        if (xfer->direction == I2C_MODE_READ)
        {
            /* Need to issue read command first. */
            handle->state = (uint8_t)kIssueReadCommandState;
        }
        else
        {
            /* Start immediately in the data transfer state. */
            handle->state = (uint8_t)kTransferDataState;
        }

        handle->buf            = (uint8_t *)xfer->data;
        handle->remainingBytes = (uint16_t)xfer->dataSize;
    }
    else
    {
        uint16_t *cmd     = (uint16_t *)&handle->commandBuffer;
        uint32_t cmdCount = 0U;

        /* Initial direction depends on whether a subaddress was provided, and of course the actual */
        /* data transfer direction. */
        I2C_ModeTypeDef direction = (0U != xfer->subaddressSize) ? I2C_MODE_WRITE : xfer->direction;

        /* Start command. */
        if(xfer->slaveAddress & I2C_SLAVE_ADDR10B_MSB_MASK)
        {
            // 10-bit slave address
            cmd[cmdCount++] =
                (uint16_t)kStartCmd | (uint16_t)((uint16_t)((((uint16_t)xfer->slaveAddress & I2C_SLAVE_ADDR10B_MSB_MASK) >> (8 - 1)) | I2C_SLAVE_ADDR10B_MSB) | (uint16_t)direction);
            cmd[cmdCount++] =
                (uint16_t)((uint16_t)((uint16_t)xfer->slaveAddress & I2C_SLAVE_ADDR10B_LSB_MASK));
        }
        else
        {
            // 7-bit slave address
            cmd[cmdCount++] =
                (uint16_t)kStartCmd | (uint16_t)((uint16_t)((uint16_t)xfer->slaveAddress << 1U) | (uint16_t)direction);
        }

        /* Subaddress, MSB first. */
        if (0U != xfer->subaddressSize)
        {
            uint32_t subaddressRemaining = xfer->subaddressSize;
            while (0U != (subaddressRemaining--))
            {
                uint8_t subaddressByte = (uint8_t)((xfer->subaddress >> (8U * subaddressRemaining)) & 0xffU);
                cmd[cmdCount++]        = subaddressByte;
            }
        }

        /* Reads need special handling. */
        if ((0U != xfer->dataSize) && (xfer->direction == I2C_MODE_READ))
        {
            /* Need to send repeated start if switching directions to read. */
            if (direction == I2C_MODE_WRITE)
            {
                if(xfer->slaveAddress & I2C_SLAVE_ADDR10B_MSB_MASK)
                {
                    // 10-bit slave address
                    cmd[cmdCount++] =
                        (uint16_t)kStartCmd | (uint16_t)((uint16_t)((((uint16_t)xfer->slaveAddress & I2C_SLAVE_ADDR10B_MSB_MASK) >> (8 - 1)) | I2C_SLAVE_ADDR10B_MSB) | (uint16_t)I2C_MODE_READ);
                }
                else
                {
                    // 7-bit slave address
                    cmd[cmdCount++] = (uint16_t)kStartCmd |
                        (uint16_t)((uint16_t)((uint16_t)xfer->slaveAddress << 1U) | (uint16_t)I2C_MODE_READ);
                }
            }
        }

        /* Set up state machine for transferring the commands. */
        handle->state          = (uint8_t)kSendCommandState;
        handle->remainingBytes = (uint16_t)cmdCount;
        handle->buf            = (uint8_t *)&handle->commandBuffer;
    }
}

/**
 * @brief 以非阻塞方式执行I2C主机传输
 *
 * 此函数用于以非阻塞方式通过I2C主机接口执行数据传输。它可以处理读操作和写操作。
 *
 * @param I2Cx I2C模块的外设基地址
 * @param handle 指向I2C主机句柄的指针，该句柄包含传输的状态信息
 * @param transfer 指向包含传输配置的指针
 *
 * @return 返回操作的状态码。可能的状态码包括：
 *          - kStatus_Success: 操作成功
 *          - kStatus_InvalidArgument: 参数无效，例如传输的数据大小超出限制
 *          - kStatus_LPI2C_Busy: I2C总线正在忙，无法启动新的传输
 */
status_t LPI2C_MasterTransferNonBlocking(I2C_TypeDef *I2Cx,
                                         lpi2c_master_handle_t *handle,
                                         lpi2c_master_transfer_t *transfer)
{
    assert_param(NULL != handle);
    assert_param(NULL != transfer);
    assert_param(transfer->subaddressSize <= sizeof(transfer->subaddress));

