JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
    status_t result;

    /* Check transfer data size in read operation. */
    if ((transfer->direction == I2C_MODE_READ) &&
        (transfer->dataSize > (256U * (uint32_t)FSL_FEATURE_I2C_FIFO_SIZEn(I2Cx))))
    {
        return kStatus_InvalidArgument;
    }

    /* Return busy if another transaction is in progress. */
    if (handle->state != (uint8_t)kIdleState)
    {
        result = kStatus_LPI2C_Busy;
    }
    else
    {
        result = LPI2C_CheckForBusyBus(I2Cx);
    }

    if ((status_t)kStatus_Success == result)
    {
        /* Disable LPI2C IRQ sources while we configure stuff. */
        LPI2C_MasterDisableInterrupts(I2Cx, (uint32_t)kLPI2C_MasterIrqFlags);

        /* Reset FIFO in case there are data. */
        I2Cx->MCR0 |= I2Cx_MCR0_RXFIFORST_Msk | I2Cx_MCR0_TXFIFORST_Msk;

        /* Save transfer into handle. */
        handle->transfer = *transfer;

        /* Generate commands to send. */
        LPI2C_InitTransferStateMachine(handle);

        /* Clear all flags. */
        I2C_MasterClearFlag(I2Cx, (uint32_t)kLPI2C_MasterClearFlags);

        /* Turn off auto-stop option. */
        I2Cx->MCR2 &= ~I2Cx_MCR2_AUTOSTOP_Msk;

        /* Enable LPI2C internal IRQ sources. NVIC IRQ was enabled in CreateHandle() */
        LPI2C_MasterEnableInterrupts(I2Cx, (uint32_t)kLPI2C_MasterIrqFlags);
    }

    return result;
}

/**
 * @brief 获取I2C主机在传输过程中已传输的字节数
 *
 * 该函数用于获取I2C主机在传输过程中已经传输的字节数。
 *
 * @param I2Cx I2C模块的指针
 * @param handle I2C主机传输句柄
 * @param count 指向一个size_t类型的指针，用于存储已传输的字节数
 *
 * @return 返回操作状态，成功时返回kStatus_Success，失败时返回相应的错误码
 *         - kStatus_Success: 操作成功
 *         - kStatus_InvalidArgument: 输入参数无效
 *         - kStatus_NoTransferInProgress: 当前没有正在进行的传输
 */
status_t LPI2C_MasterTransferGetCount(I2C_TypeDef *I2Cx, lpi2c_master_handle_t *handle, size_t *count)
{
    status_t result = kStatus_Success;

    assert_param(NULL != handle);

    if (NULL == count)
    {
        result = kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    else if (handle->state == (uint8_t)kIdleState)
    {
        *count = 0;
        result = kStatus_NoTransferInProgress;
    }
    else
    {
        uint8_t state;
        uint16_t remainingBytes;
        uint32_t dataSize;

        /* Cache some fields with IRQs disabled. This ensures all field values */
        /* are synchronized with each other during an ongoing transfer. */
        uint32_t irqs = LPI2C_MasterGetEnabledInterrupts(I2Cx);
        LPI2C_MasterDisableInterrupts(I2Cx, irqs);
        state          = handle->state;
        remainingBytes = handle->remainingBytes;
        dataSize       = handle->transfer.dataSize;
        LPI2C_MasterEnableInterrupts(I2Cx, irqs);

        /* Get transfer count based on current transfer state. */
        switch (state)
        {
            case (uint8_t)kIdleState:
            case (uint8_t)kSendCommandState:
            case (uint8_t)
                kIssueReadCommandState: /* XXX return correct value for this state when >256 reads are supported */
                *count = 0;
                break;

            case (uint8_t)kTransferDataState:
                *count = dataSize - remainingBytes;
                break;

            case (uint8_t)kStopState:
            case (uint8_t)kWaitForCompletionState:
            default:
                *count = dataSize;
                break;
        }
    }

    return result;
}

/**
 * @brief 中止I2C主机传输
 *
 * 中止I2C主机传输，并重置相关状态。
 *
 * @param I2Cx I2C模块指针
 * @param handle I2C主机句柄指针
 */
void LPI2C_MasterTransferAbort(I2C_TypeDef *I2Cx, lpi2c_master_handle_t *handle)
{
    if (handle->state != (uint8_t)kIdleState)
    {
        /* Disable internal IRQ enables. */
        LPI2C_MasterDisableInterrupts(I2Cx, (uint32_t)kLPI2C_MasterIrqFlags);

        /* Reset fifos. */
        I2Cx->MCR0 |= I2Cx_MCR0_RXFIFORST_Msk | I2Cx_MCR0_TXFIFORST_Msk;

        /* If master is still busy and has not send out stop signal yet. */
        if ((LPI2C_MasterGetStatusFlags(I2Cx) & ((uint32_t)kLPI2C_MasterStopDetectFlag |
                                                 (uint32_t)kLPI2C_MasterBusyFlag)) == (uint32_t)kLPI2C_MasterBusyFlag)
        {
            /* Send a stop command to finalize the transfer. */
            I2Cx->MTDR = (uint32_t)kStopCmd;
        }

        /* Reset handle. */
        handle->state = (uint8_t)kIdleState;
    }
}

/**
 * @brief 处理LPI2C主模式传输的中断请求
 *
 * 该函数处理LPI2C主模式传输的中断请求，调用状态机处理传输，并根据处理结果进行相应的操作。
 *
 * @param I2Cx LPI2C模块指针
 * @param lpi2cMasterHandle LPI2C主模式句柄指针
 */
void LPI2C_MasterTransferHandleIRQ(I2C_TypeDef *I2Cx, void *lpi2cMasterHandle)
{
    assert_param(lpi2cMasterHandle != NULL);

	lpi2c_master_handle_t *handle = (lpi2c_master_handle_t*) lpi2cMasterHandle;
	boolean_t isDone = FALSE;
	status_t result;

    /* Don't do anything if we don't have a valid handle. */
    if (NULL != handle)
    {
        if (handle->state != (uint8_t)kIdleState)
        {
            result = LPI2C_RunTransferStateMachine(I2Cx, handle, &isDone);

            if ((result != kStatus_Success) || isDone)
            {
                /* Handle error, terminate xfer */
                if (result != kStatus_Success)
                {
                    LPI2C_MasterTransferAbort(I2Cx, handle);
                }

                /* Disable internal IRQ enables. */
                LPI2C_MasterDisableInterrupts(I2Cx, (uint32_t)kLPI2C_MasterIrqFlags);

                /* Set handle to idle state. */
                handle->state = (uint8_t)kIdleState;

                /* Invoke callback. */
                if (NULL != handle->completionCallback)
                {
                    handle->completionCallback(I2Cx, handle, result, handle->userData);
                }
            }
        }
    }
}

/**
 * @brief I2C从设备去初始化函数
 *
 * 该函数用于停止I2C从设备并将其关闭。
 *
 * @param I2Cx I2C外设指针，指向需要停止并关闭的I2C外设。
 */
void I2C_SlaveDeinit(I2C_TypeDef *I2Cx)
{
    I2C_SlaveSoftReset(I2Cx);

    I2C_DeInit(I2Cx);
}

/**
 * @brief 检查并清除LPI2C从机错误
 *
 * 检查指定I2C设备上的从机错误标志，并清除这些错误。
 *
 * @param I2Cx 指向I2C设备的指针
 * @param flags 需要检查的错误标志位掩码
 *
 * @return 如果检测到错误，则返回相应的错误状态码；否则返回kStatus_Success
 */
static status_t LPI2C_SlaveCheckAndClearError(I2C_TypeDef *I2Cx, uint32_t flags)
{
    status_t result = kStatus_Success;

