JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/src/cw32l012_lpi2c.c
    /* Look up instance number */
    instance = LPI2C_GetInstance(I2Cx);

    /* Save base and instance. */
    handle->callback = callback;
    handle->userData = userData;

    /* Save this handle for IRQ use. */
    s_lpi2cSlaveHandle[instance] = handle;

    /* Set irq handler. */
    s_lpi2cSlaveIsr = LPI2C_SlaveTransferHandleIRQ;

    /* Clear internal IRQ enables and enable NVIC IRQ. */
    LPI2C_SlaveDisableInterrupts(I2Cx, (uint32_t)kLPI2C_SlaveIrqFlags);
    //(void)EnableIRQ(kLpi2cIrqs[instance]);
    NVIC_ClearPendingIRQ(kLpi2cIrqs[instance]);
    NVIC_EnableIRQ(kLpi2cIrqs[instance]);

    /* Nack by default. */
    I2Cx->STAR = I2Cx_STAR_TXNACK_Msk;
}

/**
 * @brief 以非阻塞方式执行从设备I2C传输
 *
 * 该函数用于以非阻塞方式执行从设备的I2C传输操作。如果当前没有正在进行的传输，函数将配置传输，并启动传输过程。
 * 如果当前有传输正在进行或总线已被其他设备占用，则返回相应的错误状态。
 *
 * @param I2Cx I2C模块指针，指向要使用的I2C模块的寄存器地址
 * @param handle 从设备句柄，指向存储从设备配置和状态的结构体
 * @param eventMask 事件掩码，指定需要监听的事件类型
 *
 * @return 函数执行状态。如果成功，则返回kStatus_Success；如果失败，则返回相应的错误代码
 */
status_t LPI2C_SlaveTransferNonBlocking(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle, uint32_t eventMask)
{
    status_t result = kStatus_Success;

    assert_param(NULL != handle);

    /* Return busy if another transaction is in progress. */
    if (handle->isBusy)
    {
        result = kStatus_LPI2C_Busy;
    }
    else
    {
        /* Return an error if the bus is already in use not by us. */
        uint32_t status = LPI2C_SlaveGetStatusFlags(I2Cx);
        if ((0U != (status & (uint32_t)kLPI2C_SlaveBusBusyFlag)) && (0U == (status & (uint32_t)kLPI2C_SlaveBusyFlag)))
        {
            result = kStatus_LPI2C_Busy;
        }
    }

    if ((status_t)kStatus_Success == result)
    {
        /* Disable LPI2C IRQ sources while we configure stuff. */
        LPI2C_SlaveDisableInterrupts(I2Cx, (uint32_t)kLPI2C_SlaveIrqFlags);

        /* Clear transfer in handle. */
        (void)memset(&handle->transfer, 0, sizeof(handle->transfer));

        /* Record that we're busy. */
        handle->isBusy = TRUE;

        /* Set up event mask. tx and rx are always enabled. */
        handle->eventMask = eventMask | (uint32_t)kLPI2C_SlaveTransmitEvent | (uint32_t)kLPI2C_SlaveReceiveEvent;

        /* Ack by default. */
        I2Cx->STAR = 0U;

        /* Clear all flags. */
        I2C_SlaveClearFlag(I2Cx, (uint32_t)kLPI2C_SlaveClearFlags);

        /* Enable LPI2C internal IRQ sources. NVIC IRQ was enabled in CreateHandle() */
        LPI2C_SlaveEnableInterrupts(I2Cx, (uint32_t)kLPI2C_SlaveIrqFlags);
    }

    return result;
}

/**
 * @brief 获取 I2C 从设备传输的数据量
 *
 * 此函数用于获取 I2C 从设备当前传输的数据量。
 *
 * @param I2Cx I2C 外设的基地址指针
 * @param handle I2C 从设备的句柄指针
 * @param count 用于存储获取到的传输数据量的指针
 *
 * @return 函数执行状态。
 *         - kStatus_Success: 成功获取传输数据量。
 *         - kStatus_InvalidArgument: 传入参数无效。
 *         - kStatus_NoTransferInProgress: 当前没有传输正在进行。
 */
status_t LPI2C_SlaveTransferGetCount(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle, size_t *count)
{
		(void)I2Cx;//消除警告
    status_t status = kStatus_Success;
	
    assert_param(NULL != handle);

    if (count == NULL)
    {
        status = kStatus_InvalidArgument;
    }

    /* Catch when there is not an active transfer. */
    else if (!handle->isBusy)
    {
        *count = 0;
        status = kStatus_NoTransferInProgress;
    }

    /* For an active transfer, just return the count from the handle. */
    else
    {
        *count = handle->transferredCount;
    }

    return status;
}

/**
 * @brief 终止LPI2C从机传输
 *
 * 终止指定的LPI2C从机传输。
 *
 * @param I2Cx LPI2C模块指针
 * @param handle 从机传输句柄指针
 */
void LPI2C_SlaveTransferAbort(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle)
{
    assert_param(NULL != handle);

    /* Return idle if no transaction is in progress. */
    if (handle->isBusy)
    {
        /* Disable LPI2C IRQ sources. */
        LPI2C_SlaveDisableInterrupts(I2Cx, (uint32_t)kLPI2C_SlaveIrqFlags);

        /* Nack by default. */
        I2Cx->STAR = I2Cx_STAR_TXNACK_Msk;

        /* Reset transfer info. */
        (void)memset(&handle->transfer, 0, sizeof(handle->transfer));

        /* We're no longer busy. */
        handle->isBusy = FALSE;
    }
}

/**
 * @brief 处理I2C从机传输中断
 *
 * 处理I2C从机传输中断，根据中断状态进行相应的处理。
 *
 * @param I2Cx I2C模块指针
 * @param handle I2C从机传输句柄指针
 */
void LPI2C_SlaveTransferHandleIRQ(I2C_TypeDef *I2Cx, lpi2c_slave_handle_t *handle)
{
    uint32_t flags;
    lpi2c_slave_transfer_t *xfer;

    /* Check for a valid handle in case of a spurious interrupt. */
    if (NULL != handle)
    {
        xfer = &handle->transfer;

        /* Get status flags. */
        flags = LPI2C_SlaveGetStatusFlags(I2Cx);

        if (0U != (flags & ((uint32_t)kLPI2C_SlaveBitErrFlag | (uint32_t)kLPI2C_SlaveFifoErrFlag)))
        {
            xfer->event            = kLPI2C_SlaveCompletionEvent;
            xfer->completionStatus = LPI2C_SlaveCheckAndClearError(I2Cx, flags);

            if ((0U != (handle->eventMask & (uint32_t)kLPI2C_SlaveCompletionEvent)) && (NULL != handle->callback))
            {
                handle->callback(I2Cx, xfer, handle->userData);
            }
        }
        else
        {
            if (0U !=
                (flags & (((uint32_t)kLPI2C_SlaveRepeatedStartDetectFlag) | ((uint32_t)kLPI2C_SlaveStopDetectFlag))))
            {
                xfer->event = (0U != (flags & (uint32_t)kLPI2C_SlaveRepeatedStartDetectFlag)) ?
                                  kLPI2C_SlaveRepeatedStartEvent :
                                  kLPI2C_SlaveCompletionEvent;
                xfer->receivedAddress  = 0U;
                xfer->completionStatus = kStatus_Success;
                xfer->transferredCount = handle->transferredCount;

                if (xfer->event == kLPI2C_SlaveCompletionEvent)
                {
                    handle->isBusy = FALSE;
                }

                if (handle->wasTransmit)
                {
                    /* Subtract one from the transmit count to offset the fact that LPI2C asserts the */
                    /* tx flag before it sees the nack from the master-receiver, thus causing one more */
                    /* count that the master actually receives. */
                    --xfer->transferredCount;
                    handle->wasTransmit = FALSE;
                }

